HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
typedef struct
{
  __IO uint32_t MACCTRL;           /*!< Ethernet MAC configuration register,                        Address offset: 0x00 */
  __IO uint32_t MACFRMF;           /*!< Ethernet MAC frame filter register,                         Address offset: 0x04 */
  __IO uint32_t MACHTH;            /*!< Ethernet MAC Hash table high register,                      Address offset: 0x08 */
  __IO uint32_t MACHTL;            /*!< Ethernet MAC Hash table low register,                       Address offset: 0x0C */
  __IO uint32_t MACMIIADDR;        /*!< Ethernet MAC MII address register,                          Address offset: 0x10 */
  __IO uint32_t MACMIIDT;          /*!< Ethernet MAC MII data register,                             Address offset: 0x14 */
  __IO uint32_t MACFCTRL;          /*!< Ethernet MAC flow control register,                         Address offset: 0x18 */
  __IO uint32_t MACVLT;            /*!< Ethernet MAC VLAN tag register,                             Address offset: 0x1C */               /*  8 */
       uint32_t RESERVED0[2];      /*!< Reserved,                                                   Address offset: 0x20 ~ 0x24 */
  __IO uint32_t MACRWFF;           /*!< Ethernet MAC remote wakeup frame filter register,           Address offset: 0x28 */               /* 11 */
  __IO uint32_t MACPMTCTRLSTS;     /*!< Ethernet MAC PMT control and status register,               Address offset: 0x2C */
       uint32_t RESERVED1[2];      /*!< Reserved,                                                   Address offset: 0x30 ~ 0x34 */
  __IO uint32_t MACISTS;           /*!< Ethernet MAC interrupt status register,                     Address offset: 0x38 */               /* 15 */
  __IO uint32_t MAIMR;             /*!< Ethernet MAC interrupt mask register,                       Address offset: 0x3C */
  __IO uint32_t MACA0H;            /*!< Ethernet MAC address 0 high register,                       Address offset: 0x40 */
  __IO uint32_t MACA0L;            /*!< Ethernet MAC address 0 low register,                        Address offset: 0x44 */
  __IO uint32_t MACA1H;            /*!< Ethernet MAC address 1 high register,                       Address offset: 0x48 */
  __IO uint32_t MACA1L;            /*!< Ethernet MAC address 1 low register,                        Address offset: 0x4C */
  __IO uint32_t MACA2H;            /*!< Ethernet MAC address 2 high register,                       Address offset: 0x50 */
  __IO uint32_t MACA2L;            /*!< Ethernet MAC address 2 low register,                        Address offset: 0x54 */
  __IO uint32_t MACA3H;            /*!< Ethernet MAC address 3 high register,                       Address offset: 0x58 */
  __IO uint32_t MACA3L;            /*!< Ethernet MAC address 3 low register,                        Address offset: 0x5C */               /* 24 */
       uint32_t RESERVED2[40];     /*!< Reserved,                                                   Address offset: 0x60 ~ 0xFC */
  __IO uint32_t MMCCTRL;           /*!< Ethernet MMC control register,                              Address offset: 0x100 */              /* 65 */
  __IO uint32_t MMCRI;             /*!< Ethernet MMC receive interrupt register,                    Address offset: 0x104 */
  __IO uint32_t MMCTI;             /*!< Ethernet MMC transmit interrupt register,                   Address offset: 0x108 */
  __IO uint32_t MMCRIM;            /*!< Ethernet MMC receive interrupt register,                    Address offset: 0x10C */
  __IO uint32_t MMCTIM;            /*!< Ethernet MMC transmit interrupt register,                   Address offset: 0x110 */              /* 69 */
       uint32_t RESERVED3[14];     /*!< Reserved,                                                   Address offset: 0x114 ~ 0x148 */
  __IO uint32_t MMCTFSCC;          /*!< EMMC tx good frame 1 collision cnt reg,                     Address offset: 0x14C */              /* 84 */
  __IO uint32_t MMCTFMSCC;         /*!< EMMC tx good frame more than a 1 collision cnt register,    Address offset: 0x150 */
       uint32_t RESERVED4[5];      /*!< Reserved,                                                   Address offset: 0x154 ~ 0x164 */
  __IO uint32_t MMCTFCNT;          /*!< Ethernet MMC transmitted good frames counter register,      Address offset: 0x168 */
       uint32_t RESERVED5[10];     /*!< Reserved,                                                   Address offset: 0x16C ~ 0x190 */
  __IO uint32_t MMCRFCECNT;        /*!< EMMC received frames with CRC error counter register,       Address offset: 0x194 */
  __IO uint32_t MMCRFAECNT;        /*!< EMMC received frames with alignment error counter reg,      Address offset: 0x198 */
       uint32_t RESERVED6[10];     /*!< Reserved,                                                   Address offset: 0x19C ~ 0x1C0 */
  __IO uint32_t MMCRGUFCNT;        /*!< EMMC received good unicast frames counter register,         Address offset: 0x1C4 */
       uint32_t RESERVED7[334];    /*!< Reserved,                                                   Address offset: 0x1C8 ~ 0x6FC */
  __IO uint32_t PTPTSCTRL;         /*!< Ethernet PTP time stamp control register,                   Address offset: 0x700 */
  __IO uint32_t PTPSSINC;          /*!< Ethernet PTP subsecond increment register,                  Address offset: 0x704 */
  __IO uint32_t PTPTSH;            /*!< Ethernet PTP time stamp high register,                      Address offset: 0x708 */
  __IO uint32_t PTPTSL;            /*!< Ethernet PTP time stamp low register,                       Address offset: 0x70C */
  __IO uint32_t PTPTSHUD;          /*!< Ethernet PTP time stamp high update register,               Address offset: 0x710 */
  __IO uint32_t PTPTSLUD;          /*!< Ethernet PTP time stamp low update register,                Address offset: 0x714 */
  __IO uint32_t PTPTSAD;           /*!< Ethernet PTP time stamp addend register,                    Address offset: 0x718 */
  __IO uint32_t PTPTTH;            /*!< Ethernet PTP target time high register,                     Address offset: 0x71C */
  __IO uint32_t PTPTTL;            /*!< Ethernet PTP target time low register,                      Address offset: 0x720 */
       uint32_t RESERVED8;         /*!< Reserved,                                                   Address offset: 0x724 */
  __IO uint32_t PTPTSSR;           /*!< Ethernet PTP time stamp status register,                    Address offset: 0x728 */
  __IO uint32_t PTPPPSCR;          /*!< Ethernet PTP PPS register,                                  Address offset: 0x72C */
       uint32_t RESERVED9[565];    /*!< Reserved,                                                   Address offset: 0x730 ~ 0xFFC */
  __IO uint32_t DMABM;             /*!< Ethernet DMA bus mode register,                             Address offset: 0x1000 */
  __IO uint32_t DMATPD;            /*!< Ethernet DMA transmit poll demand register,                 Address offset: 0x1004 */
  __IO uint32_t DMARPD;            /*!< Ethernet DMA receive poll demand register,                  Address offset: 0x1008 */
  __IO uint32_t DMARDLADDR;        /*!< Ethernet DMA receive descriptor list address register,      Address offset: 0x100C */
  __IO uint32_t DMATDLADDR;        /*!< Ethernet DMA transmit descriptor list address register,     Address offset: 0x1010 */
  __IO uint32_t DMASTS;            /*!< Ethernet DMA status register,                               Address offset: 0x1014 */
  __IO uint32_t DMAOPM;            /*!< Ethernet DMA operation mode register,                       Address offset: 0x1018 */
  __IO uint32_t DMAIE;             /*!< Ethernet DMA interrupt enable register,                     Address offset: 0x101C */
  __IO uint32_t DMAMFBOCNT;        /*!< EDMA missed frame and buffer overflow counter register,     Address offset: 0x1020 */
       uint32_t RESERVED9[9];      /*!< Reserved,                                                   Address offset: 0x1024 ~ 0x1044 */
  __IO uint32_t DMACTD;            /*!< Ethernet DMA current transmit descriptor register,          Address offset: 0x1048 */
  __IO uint32_t DMACRD;            /*!< Ethernet DMA current receive descriptor register,           Address offset: 0x104C */
  __IO uint32_t DMACTBADDR;        /*!< Ethernet DMA current transmit buffer address register,      Address offset: 0x1050 */
  __IO uint32_t DMACRBADDR;        /*!< Ethernet DMA current receive buffer address register,       Address offset: 0x1054 */
} EMAC_TypeDef;

/**
  * @brief External Interrupt/Event Controller
  */

typedef struct
{
  __IO uint32_t INTEN;      /*!< EXINT Interrupt enable register,             Address offset: 0x00 */
  __IO uint32_t EVTEN;      /*!< EXINT Event enable register,                 Address offset: 0x04 */
  __IO uint32_t POLCFG1;    /*!< EXINT Polarity configuration register 1,     Address offset: 0x08 */
  __IO uint32_t POLCFG2;    /*!< EXINT Polarity configuration register 2,     Address offset: 0x0C */
  __IO uint32_t SWTRG;      /*!< EXINT Software trigger register,             Address offset: 0x10 */
  __IO uint32_t INTSTS;     /*!< EXINT Interrupt status register,             Address offset: 0x14 */
} EXINT_TypeDef;

/**
  * @brief Flash Memory Registers
  */

typedef struct
{
  __IO uint32_t PSR;               /*!< FLASH performance select register,           Address offset: 0x00        */
  __IO uint32_t UNLOCK;            /*!< FLASH unlock register 1,                     Address offset: 0x04        */
  __IO uint32_t USD_UNLOCK;        /*!< FLASH user system data unlock register,      Address offset: 0x08        */
  __IO uint32_t STS;               /*!< FLASH status register,                       Address offset: 0x0C        */
  __IO uint32_t CTRL;              /*!< FLASH control register,                      Address offset: 0x10        */
  __IO uint32_t ADDR;              /*!< FLASH address register,                      Address offset: 0x14        */
  uint32_t      RESERVED0;         /*!< Reserved,                                    Address offset: 0x18        */
  __IO uint32_t USD;               /*!< FLASH User system data register,             Address offset: 0x1C        */
  __IO uint32_t EPPS;              /*!< FLASH Erase/program protection status reg,   Address offset: 0x20        */
  uint32_t      RESERVED1[8];      /*!< Reserved,                                    Address offset: 0x24 ~ 0x40 */
  __IO uint32_t UNLOCK2;           /*!< FLASH unlock register 2,                     Address offset: 0x44        */
  uint32_t      RESERVED2;         /*!< Reserved,                                    Address offset: 0x48        */
  __IO uint32_t STS2;              /*!< FLASH status register 2,                     Address offset: 0x4C        */
  __IO uint32_t CTRL2;             /*!< FLASH control register 2,                    Address offset: 0x50        */
  __IO uint32_t ADDR2;             /*!< FLASH address register 2,                    Address offset: 0x54        */
  uint32_t      RESERVED3[11];     /*!< Reserved,                                    Address offset: 0x58 ~ 0x80 */
  __IO uint32_t UNLOCK3;           /*!< FLASH unlock register 3,                     Address offset: 0x84        */
  __IO uint32_t SELECT;            /*!< FLASH select register,                       Address offset: 0x88        */
  __IO uint32_t STS3;              /*!< FLASH status register 3,                     Address offset: 0x8C        */
  __IO uint32_t CTRL3;             /*!< FLASH control register 3,                    Address offset: 0x90        */
  __IO uint32_t ADDR3;             /*!< FLASH address register 3,                    Address offset: 0x94        */
  __IO uint32_t DA;                /*!< FLASH decrption address register,            Address offset: 0x98        */
  uint32_t      RESERVED4[12];     /*!< Reserved,                                    Address offset: 0x9C ~ 0xC8 */
  __IO uint32_t SLIB_STS0;         /*!< FLASH security library status register 0,    Address offset: 0xCC        */
  __IO uint32_t SLIB_STS1;         /*!< FLASH security library status register 1,    Address offset: 0xD0        */
  __IO uint32_t SLIB_PWD_CLR;      /*!< FLASH security library password clear reg,   Address offset: 0xD4        */
  __IO uint32_t SLIB_MISC_STS;     /*!< FLASH Security library additional stat reg,  Address offset: 0xD8        */
  __IO uint32_t SLIB_SET_PWD;      /*!< FLASH Security library password setting reg, Address offset: 0xDC        */
  __IO uint32_t SLIB_SET_RANGE;    /*!< FLASH Security library address setting reg,  Address offset: 0xE0        */
  uint32_t      RESERVED5[3];      /*!< Reserved,                                    Address offset: 0xE4 ~ 0xEC */
  __IO uint32_t SLIB_UNLOCK;       /*!< FLASH Security library unlock register,      Address offset: 0xF0        */
  __IO uint32_t CRC_CTRL;          /*!< FLASH CRC check control register,            Address offset: 0xF4        */
  __IO uint32_t CRC_CHKR;          /*!< FLASH CRC check result register,             Address offset: 0xF8        */
} FLASH_TypeDef;

/**
  * @brief User System Data Registers
  */

typedef struct
{
  __IO uint16_t FAP;                 /*!< USD memory access protection,                Address offset: 0x1FFF_F800               */
  __IO uint16_t SSB;                 /*!< USD System configuration byte,               Address offset: 0x1FFF_F802               */
  __IO uint16_t DATA0;               /*!< USD User data 0,                             Address offset: 0x1FFF_F804               */
  __IO uint16_t DATA1;               /*!< USD User data 1,                             Address offset: 0x1FFF_F806               */
  __IO uint16_t EPP0;                /*!< USD erase/write protection byte 0,           Address offset: 0x1FFF_F808               */
  __IO uint16_t EPP1;                /*!< USD erase/write protection byte 1,           Address offset: 0x1FFF_F80A               */
  __IO uint16_t EPP2;                /*!< USD erase/write protection byte 2,           Address offset: 0x1FFF_F80C               */
  __IO uint16_t EPP3;                /*!< USD erase/write protection byte 3,           Address offset: 0x1FFF_F80E               */
  __IO uint16_t EOPB0;               /*!< USD Extended system options,                 Address offset: 0x1FFF_F810               */
  uint16_t      RESERVED;            /*!< Reserved,                                    Address offset: 0x1FFF_F812 ~ 0x1FFF_F813 */
  __IO uint16_t DATA2;               /*!< USD User data 2,                             Address offset: 0x1FFF_F814               */
  __IO uint16_t DATA3;               /*!< USD User data 3,                             Address offset: 0x1FFF_F816               */
  __IO uint16_t DATA4;               /*!< USD User data 4,                             Address offset: 0x1FFF_F818               */
  __IO uint16_t DATA5;               /*!< USD User data 5,                             Address offset: 0x1FFF_F81A               */
  __IO uint16_t DATA6;               /*!< USD User data 6,                             Address offset: 0x1FFF_F81C               */
  __IO uint16_t DATA7;               /*!< USD User data 7,                             Address offset: 0x1FFF_F81E               */
  __IO uint16_t EXT_FLASH_KEY[8];    /*!< USD Ext memory ciphertext encryption key,    Address offset: 0x1FFF_F820 ~ 0x1FFF_F82F */
} USD_TypeDef;

/**
  * @brief General Purpose I/O
  */

typedef struct
{
  __IO uint32_t CFGLR;          /*!< GPIO configuration register low,             Address offset: 0x00        */
  __IO uint32_t CFGHR;          /*!< GPIO configuration register high,            Address offset: 0x04        */
  __IO uint32_t IDT;            /*!< GPIO input data register,                    Address offset: 0x08        */
  __IO uint32_t ODT;            /*!< GPIO output data register,                   Address offset: 0x0C        */
  __IO uint32_t SCR;            /*!< GPIO set/clear register,                     Address offset: 0x10        */
  __IO uint32_t CLR;            /*!< GPIO clear register,                         Address offset: 0x14        */
  __IO uint32_t WPR;            /*!< GPIO write protection register,              Address offset: 0x18        */
  uint32_t      RESERVED[8];    /*!< Reserved,                                    Address offset: 0x1C ~ 0x38 */
  __IO uint32_t HDRV;           /*!< GPIO huge current control register,          Address offset: 0x3C        */
} GPIO_TypeDef;

/**
  * @brief Multiplex Function I/O
  */

typedef struct
{
  __IO uint32_t EVTOUT;      /*!< IOMUX Event output control register,         Address offset: 0x00 */
  __IO uint32_t REMAP;       /*!< IOMUX remap register 1,                      Address offset: 0x04 */
  __IO uint32_t EXINTC1;     /*!< IOMUX external interrupt config register 1,  Address offset: 0x08 */
  __IO uint32_t EXINTC2;     /*!< IOMUX external interrupt config register 2,  Address offset: 0x0C */
  __IO uint32_t EXINTC3;     /*!< IOMUX external interrupt config register 3,  Address offset: 0x10 */
  __IO uint32_t EXINTC4;     /*!< IOMUX external interrupt config register 4,  Address offset: 0x14 */
  uint32_t      RESERVED;    /*!< Reserved,                                    Address offset: 0x18 */
  __IO uint32_t REMAP2;      /*!< IOMUX remap register 2,                      Address offset: 0x1C */
  __IO uint32_t REMAP3;      /*!< IOMUX remap register 3,                      Address offset: 0x20 */
  __IO uint32_t REMAP4;      /*!< IOMUX remap register 4,                      Address offset: 0x24 */
  __IO uint32_t REMAP5;      /*!< IOMUX remap register 5,                      Address offset: 0x28 */
  __IO uint32_t REMAP6;      /*!< IOMUX remap register 6,                      Address offset: 0x2C */
  __IO uint32_t REMAP7;      /*!< IOMUX remap register 7,                      Address offset: 0x30 */
  __IO uint32_t REMAP8;      /*!< IOMUX remap register 8,                      Address offset: 0x34 */
} IOMUX_TypeDef;

/**
  * @brief Inter Integrated Circuit Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< I2C Control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< I2C Control register 2,                      Address offset: 0x04 */
  __IO uint32_t OADDR1;     /*!< I2C Own address register 1,                  Address offset: 0x08 */
  __IO uint32_t OADDR2;     /*!< I2C Own address register 2,                  Address offset: 0x0C */
  __IO uint32_t DT;         /*!< I2C Data register,                           Address offset: 0x10 */
  __IO uint32_t STS1;       /*!< I2C Status register 1,                       Address offset: 0x14 */
  __IO uint32_t STS2;       /*!< I2C Status register 2,                       Address offset: 0x18 */
  __IO uint32_t CLKCTRL;    /*!< I2C Clock control register,                  Address offset: 0x1C */
  __IO uint32_t TMRISE;     /*!< I2C timer rise time register,                Address offset: 0x20 */
} I2C_TypeDef;

/**
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CTRL;       /*!< PWC Power control register,                  Address offset: 0x00 */
  __IO uint32_t CTRLSTS;    /*!< PWC Power control/status register,           Address offset: 0x04 */
} PWC_TypeDef;

/**
  * @brief Real-Time Clock
  */

typedef struct
{
  __IO uint32_t CTRLH;      /*!< RTC control register high,                   Address offset: 0x00 */
  __IO uint32_t CTRLL;      /*!< RTC control register low,                    Address offset: 0x04 */
  __IO uint32_t DIVH;       /*!< RTC divider register high,                   Address offset: 0x08 */
  __IO uint32_t DIVL;       /*!< RTC divider register low,                    Address offset: 0x0C */
  __IO uint32_t DIVCNTH;    /*!< RTC divider counter register high,           Address offset: 0x10 */
  __IO uint32_t DIVCNTL;    /*!< RTC divider counter register low,            Address offset: 0x14 */
  __IO uint32_t CNTH;       /*!< RTC counter value register high,             Address offset: 0x18 */
  __IO uint32_t CNTL;       /*!< RTC counter value register low,              Address offset: 0x1C */
  __IO uint32_t TAH;        /*!< RTC alarm register high,                     Address offset: 0x20 */
  __IO uint32_t TAL;        /*!< RTC alarm register low,                      Address offset: 0x24 */
} RTC_TypeDef;

/**
  * @brief SD Host Interface
  */

typedef struct
{
  __IO uint32_t PWRCTRL;          /*!< SDIO power control register,                 Address offset: 0x00        */
  __IO uint32_t CLKCTRL;          /*!< SDIO clock control register,                 Address offset: 0x04        */
  __IO uint32_t ARG;              /*!< SDIO argument register,                      Address offset: 0x08        */
  __IO uint32_t CMD;              /*!< SDIO command register,                       Address offset: 0x0C        */
  __I  uint32_t RSPCMD;           /*!< SDIO command response register,              Address offset: 0x10        */
  __I  uint32_t RSP1;             /*!< SDIO response register 1,                    Address offset: 0x14        */
  __I  uint32_t RSP2;             /*!< SDIO response register 2,                    Address offset: 0x18        */
  __I  uint32_t RSP3;             /*!< SDIO response register 3,                    Address offset: 0x1C        */
  __I  uint32_t RSP4;             /*!< SDIO response register 4,                    Address offset: 0x20        */
  __IO uint32_t DTTMR;            /*!< SDIO data timer register,                    Address offset: 0x24        */
  __IO uint32_t DTLEN;            /*!< SDIO data length register,                   Address offset: 0x28        */
  __IO uint32_t DTCTRL;           /*!< SDIO data control register,                  Address offset: 0x2C        */
  __I  uint32_t DTCNTR;           /*!< SDIO data counter register,                  Address offset: 0x30        */
  __I  uint32_t STS;              /*!< SDIO status register,                        Address offset: 0x34        */
  __IO uint32_t INTCLR;           /*!< SDIO clear interrupt register,               Address offset: 0x38        */
  __IO uint32_t INTEN;            /*!< SDIO interrupt mask register,                Address offset: 0x3C        */
  uint32_t      RESERVED0[2];     /*!< Reserved,                                    Address offset: 0x40 ~ 0x44 */
  __I  uint32_t BUFCNTR;          /*!< SDIO BUF counter register,                   Address offset: 0x48        */
  uint32_t      RESERVED1[13];    /*!< Reserved,                                    Address offset: 0x4C ~ 0x7C */
  __IO uint32_t BUF;              /*!< SDIO data BUF register,                      Address offset: 0x80        */
} SDIO_TypeDef;

/**
  * @brief Serial Peripheral Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< SPI control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< SPI control register 2,                      Address offset: 0x04 */
  __IO uint32_t STS;        /*!< SPI status register,                         Address offset: 0x08 */
  __IO uint32_t DT;         /*!< SPI data register,                           Address offset: 0x0C */
  __IO uint32_t CPOLY;      /*!< SPI CRC register,                            Address offset: 0x10 */
  __IO uint32_t RCRC;       /*!< SPI RX CRC register,                         Address offset: 0x14 */
  __IO uint32_t TCRC;       /*!< SPI TX CRC register,                         Address offset: 0x18 */
  __IO uint32_t I2SCTRL;    /*!< SPI_I2S register,                            Address offset: 0x1C */
  __IO uint32_t I2SCLKP;    /*!< SPI_I2S prescaler register,                  Address offset: 0x20 */
} SPI_TypeDef;

/**
  * @brief TMR Timers
  */

