HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
#define TMR2_BASE             (APB1PERIPH_BASE + 0x00000000U) /*!< TMR2 base address                              */
#define TMR3_BASE             (APB1PERIPH_BASE + 0x00000400U) /*!< TMR3 base address                              */
#define TMR4_BASE             (APB1PERIPH_BASE + 0x00000800U) /*!< TMR4 base address                              */
#define TMR5_BASE             (APB1PERIPH_BASE + 0x00000C00U) /*!< TMR5 base address                              */
#define TMR6_BASE             (APB1PERIPH_BASE + 0x00001000U) /*!< TMR6 base address                              */
#define TMR7_BASE             (APB1PERIPH_BASE + 0x00001400U) /*!< TMR7 base address                              */
#define TMR12_BASE            (APB1PERIPH_BASE + 0x00001800U) /*!< TMR12 base address                             */
#define TMR13_BASE            (APB1PERIPH_BASE + 0x00001C00U) /*!< TMR13 base address                             */
#define TMR14_BASE            (APB1PERIPH_BASE + 0x00002000U) /*!< TMR14 base address                             */
#define RTC_BASE              (APB1PERIPH_BASE + 0x00002800U) /*!< RTC base address                               */
#define WWDT_BASE             (APB1PERIPH_BASE + 0x00002C00U) /*!< WWDT base address                              */
#define WDT_BASE              (APB1PERIPH_BASE + 0x00003000U) /*!< WDT base address                               */
#define SPI2_BASE             (APB1PERIPH_BASE + 0x00003800U) /*!< SPI2 base address                              */
#define SPI3_BASE             (APB1PERIPH_BASE + 0x00003C00U) /*!< SPI3 base address                              */
#define SPI4_BASE             (APB1PERIPH_BASE + 0x00004000U) /*!< SPI4 base address                              */
#define USART2_BASE           (APB1PERIPH_BASE + 0x00004400U) /*!< USART2 base address                            */
#define USART3_BASE           (APB1PERIPH_BASE + 0x00004800U) /*!< USART3 base address                            */
#define UART4_BASE            (APB1PERIPH_BASE + 0x00004C00U) /*!< UART4 base address                             */
#define UART5_BASE            (APB1PERIPH_BASE + 0x00005000U) /*!< UART5 base address                             */
#define I2C1_BASE             (APB1PERIPH_BASE + 0x00005400U) /*!< I2C1 base address                              */
#define I2C2_BASE             (APB1PERIPH_BASE + 0x00005800U) /*!< I2C2 base address                              */
#define CAN1_BASE             (APB1PERIPH_BASE + 0x00006400U) /*!< CAN1 base address                              */
#define CAN2_BASE             (APB1PERIPH_BASE + 0x00006800U) /*!< CAN2 base address                              */
#define BPR_BASE              (APB1PERIPH_BASE + 0x00006C00U) /*!< BPR base address                               */
#define PWC_BASE              (APB1PERIPH_BASE + 0x00007000U) /*!< PWC base address                               */
#define DAC_BASE              (APB1PERIPH_BASE + 0x00007400U) /*!< DAC base address                               */
#define IOMUX_BASE            (APB2PERIPH_BASE + 0x00000000U) /*!< IOMUX base address                             */
#define EXINT_BASE            (APB2PERIPH_BASE + 0x00000400U) /*!< EXINT base address                             */
#define GPIOA_BASE            (APB2PERIPH_BASE + 0x00000800U) /*!< GPIOA base address                             */
#define GPIOB_BASE            (APB2PERIPH_BASE + 0x00000C00U) /*!< GPIOB base address                             */
#define GPIOC_BASE            (APB2PERIPH_BASE + 0x00001000U) /*!< GPIOC base address                             */
#define GPIOD_BASE            (APB2PERIPH_BASE + 0x00001400U) /*!< GPIOD base address                             */
#define GPIOE_BASE            (APB2PERIPH_BASE + 0x00001800U) /*!< GPIOE base address                             */
#define ADC1_BASE             (APB2PERIPH_BASE + 0x00002400U) /*!< ADC1 base address                              */
#define ADC2_BASE             (APB2PERIPH_BASE + 0x00002800U) /*!< ADC2 base address                              */
#define TMR1_BASE             (APB2PERIPH_BASE + 0x00002C00U) /*!< TMR1 base address                              */
#define SPI1_BASE             (APB2PERIPH_BASE + 0x00003000U) /*!< SPI1 base address                              */
#define TMR8_BASE             (APB2PERIPH_BASE + 0x00003400U) /*!< TMR8 base address                              */
#define USART1_BASE           (APB2PERIPH_BASE + 0x00003800U) /*!< USART1 base address                            */
#define ADC3_BASE             (APB2PERIPH_BASE + 0x00003C00U) /*!< ADC3 base address                              */
#define TMR9_BASE             (APB2PERIPH_BASE + 0x00004C00U) /*!< TMR9 base address                              */
#define TMR10_BASE            (APB2PERIPH_BASE + 0x00005000U) /*!< TMR10 base address                             */
#define TMR11_BASE            (APB2PERIPH_BASE + 0x00005400U) /*!< TMR11 base address                             */
#define ACC_BASE              (APB2PERIPH_BASE + 0x00005800U) /*!< ACC base address                               */
#define I2C3_BASE             (APB2PERIPH_BASE + 0x00005C00U) /*!< I2C3 base address                              */
#define USART6_BASE           (APB2PERIPH_BASE + 0x00006000U) /*!< USART6 base address                            */
#define UART7_BASE            (APB2PERIPH_BASE + 0x00006400U) /*!< UART7 base address                             */
#define UART8_BASE            (APB2PERIPH_BASE + 0x00006800U) /*!< UART8 base address                             */
#define I2S2EXT_BASE          (APB2PERIPH_BASE + 0x00006C00U) /*!< I2S2EXT base address                           */
#define I2S3EXT_BASE          (APB2PERIPH_BASE + 0x00007000U) /*!< I2S3EXT base address                           */

#define SDIO1_BASE            (PERIPH_BASE + 0x00018000U)     /*!< SDIO1 base address                             */
#define SDIO2_BASE            (PERIPH_BASE + 0x00023400U)     /*!< SDIO2 base address                             */

