HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
/* Legacy defines */
#define PWC_CTRL_PVMSEL_2V3                 PWC_CTRL_PVMSEL_LEV1
#define PWC_CTRL_PVMSEL_2V4                 PWC_CTRL_PVMSEL_LEV2
#define PWC_CTRL_PVMSEL_2V5                 PWC_CTRL_PVMSEL_LEV3
#define PWC_CTRL_PVMSEL_2V6                 PWC_CTRL_PVMSEL_LEV4
#define PWC_CTRL_PVMSEL_2V7                 PWC_CTRL_PVMSEL_LEV5
#define PWC_CTRL_PVMSEL_2V8                 PWC_CTRL_PVMSEL_LEV6
#define PWC_CTRL_PVMSEL_2V9                 PWC_CTRL_PVMSEL_LEV7

#define PWC_CTRL_BPWEN_Pos                  (8U)
#define PWC_CTRL_BPWEN_Msk                  (0x1U << PWC_CTRL_BPWEN_Pos)            /*!< 0x00000100 */
#define PWC_CTRL_BPWEN                      PWC_CTRL_BPWEN_Msk                      /*!< Battery powered domain write enable */

/*****************  Bit definition for PWC_CTRLSTS register  ******************/
#define PWC_CTRLSTS_SWEF_Pos                (0U)
#define PWC_CTRLSTS_SWEF_Msk                (0x1U << PWC_CTRLSTS_SWEF_Pos)          /*!< 0x00000001 */
#define PWC_CTRLSTS_SWEF                    PWC_CTRLSTS_SWEF_Msk                    /*!< Standby wake-up event flag */
#define PWC_CTRLSTS_SEF_Pos                 (1U)
#define PWC_CTRLSTS_SEF_Msk                 (0x1U << PWC_CTRLSTS_SEF_Pos)           /*!< 0x00000002 */
#define PWC_CTRLSTS_SEF                     PWC_CTRLSTS_SEF_Msk                     /*!< Standby mode entry flag */
#define PWC_CTRLSTS_PVMOF_Pos               (2U)
#define PWC_CTRLSTS_PVMOF_Msk               (0x1U << PWC_CTRLSTS_PVMOF_Pos)         /*!< 0x00000004 */
#define PWC_CTRLSTS_PVMOF                   PWC_CTRLSTS_PVMOF_Msk                   /*!< Power voltage monitoring output flag */
#define PWC_CTRLSTS_SWPEN_Pos               (8U)
#define PWC_CTRLSTS_SWPEN_Msk               (0x1U << PWC_CTRLSTS_SWPEN_Pos)         /*!< 0x00000100 */
#define PWC_CTRLSTS_SWPEN                   PWC_CTRLSTS_SWPEN_Msk                   /*!< Standby wake-up pin enable */

/******************************************************************************/
/*                                                                            */
/*                        Clock and reset manage (CRM)                        */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CRM_CTRL register  *******************/
#define CRM_CTRL_HICKEN_Pos                 (0U)
#define CRM_CTRL_HICKEN_Msk                 (0x1U << CRM_CTRL_HICKEN_Pos)           /*!< 0x00000001 */
#define CRM_CTRL_HICKEN                     CRM_CTRL_HICKEN_Msk                     /*!< High speed internal clock enable */
#define CRM_CTRL_HICKSTBL_Pos               (1U)
#define CRM_CTRL_HICKSTBL_Msk               (0x1U << CRM_CTRL_HICKSTBL_Pos)         /*!< 0x00000002 */
#define CRM_CTRL_HICKSTBL                   CRM_CTRL_HICKSTBL_Msk                   /*!< High speed internal clock stable */
#define CRM_CTRL_HICKTRIM_Pos               (2U)
#define CRM_CTRL_HICKTRIM_Msk               (0x3FU << CRM_CTRL_HICKTRIM_Pos)        /*!< 0x000000FC */
#define CRM_CTRL_HICKTRIM                   CRM_CTRL_HICKTRIM_Msk                   /*!< High speed internal clock trimming */
#define CRM_CTRL_HICKCAL_Pos                (8U)
#define CRM_CTRL_HICKCAL_Msk                (0xFFU << CRM_CTRL_HICKCAL_Pos)         /*!< 0x0000FF00 */
#define CRM_CTRL_HICKCAL                    CRM_CTRL_HICKCAL_Msk                    /*!< High speed internal clock calibration */
#define CRM_CTRL_HEXTEN_Pos                 (16U)
#define CRM_CTRL_HEXTEN_Msk                 (0x1U << CRM_CTRL_HEXTEN_Pos)           /*!< 0x00010000 */
#define CRM_CTRL_HEXTEN                     CRM_CTRL_HEXTEN_Msk                     /*!< High speed external crystal enable */
#define CRM_CTRL_HEXTSTBL_Pos               (17U)
#define CRM_CTRL_HEXTSTBL_Msk               (0x1U << CRM_CTRL_HEXTSTBL_Pos)         /*!< 0x00020000 */
#define CRM_CTRL_HEXTSTBL                   CRM_CTRL_HEXTSTBL_Msk                   /*!< High speed external crystal stable */
#define CRM_CTRL_HEXTBYPS_Pos               (18U)
#define CRM_CTRL_HEXTBYPS_Msk               (0x1U << CRM_CTRL_HEXTBYPS_Pos)         /*!< 0x00040000 */
#define CRM_CTRL_HEXTBYPS                   CRM_CTRL_HEXTBYPS_Msk                   /*!< High speed external crystal bypass */
#define CRM_CTRL_CFDEN_Pos                  (19U)
#define CRM_CTRL_CFDEN_Msk                  (0x1U << CRM_CTRL_CFDEN_Pos)            /*!< 0x00080000 */
#define CRM_CTRL_CFDEN                      CRM_CTRL_CFDEN_Msk                      /*!< Clock failure detector enable */
#define CRM_CTRL_PLLEN_Pos                  (24U)
#define CRM_CTRL_PLLEN_Msk                  (0x1U << CRM_CTRL_PLLEN_Pos)            /*!< 0x01000000 */
#define CRM_CTRL_PLLEN                      CRM_CTRL_PLLEN_Msk                      /*!< PLL enable */
#define CRM_CTRL_PLLSTBL_Pos                (25U)
#define CRM_CTRL_PLLSTBL_Msk                (0x1U << CRM_CTRL_PLLSTBL_Pos)          /*!< 0x02000000 */
#define CRM_CTRL_PLLSTBL                    CRM_CTRL_PLLSTBL_Msk                    /*!< PLL clock stable */

/*******************  Bit definition for CRM_CFG register  ********************/
/*!< SCLKSEL configuration */
#define CRM_CFG_SCLKSEL_Pos                 (0U)
#define CRM_CFG_SCLKSEL_Msk                 (0x3U << CRM_CFG_SCLKSEL_Pos)           /*!< 0x00000003 */
#define CRM_CFG_SCLKSEL                     CRM_CFG_SCLKSEL_Msk                     /*!< SCLKSEL[1:0] bits (System clock select) */
#define CRM_CFG_SCLKSEL_0                   (0x1U << CRM_CFG_SCLKSEL_Pos)           /*!< 0x00000001 */
#define CRM_CFG_SCLKSEL_1                   (0x2U << CRM_CFG_SCLKSEL_Pos)           /*!< 0x00000002 */

#define CRM_CFG_SCLKSEL_HICK                0x00000000U                             /*!< HICK */
#define CRM_CFG_SCLKSEL_HEXT                0x00000001U                             /*!< HEXT */
#define CRM_CFG_SCLKSEL_PLL                 0x00000002U                             /*!< PLL */

/*!< SCLKSTS configuration */
#define CRM_CFG_SCLKSTS_Pos                 (2U)
#define CRM_CFG_SCLKSTS_Msk                 (0x3U << CRM_CFG_SCLKSTS_Pos)           /*!< 0x0000000C */
#define CRM_CFG_SCLKSTS                     CRM_CFG_SCLKSTS_Msk                     /*!< SCLKSTS[1:0] bits (System clock select status) */
#define CRM_CFG_SCLKSTS_0                   (0x1U << CRM_CFG_SCLKSTS_Pos)           /*!< 0x00000004 */
#define CRM_CFG_SCLKSTS_1                   (0x2U << CRM_CFG_SCLKSTS_Pos)           /*!< 0x00000008 */

#define CRM_CFG_SCLKSTS_HICK                0x00000000U                             /*!< HICK */
#define CRM_CFG_SCLKSTS_HEXT                0x00000004U                             /*!< HEXT */
#define CRM_CFG_SCLKSTS_PLL                 0x00000008U                             /*!< PLL */

/*!< AHBDIV configuration */
#define CRM_CFG_AHBDIV_Pos                  (4U)
#define CRM_CFG_AHBDIV_Msk                  (0xFU << CRM_CFG_AHBDIV_Pos)            /*!< 0x000000F0 */
#define CRM_CFG_AHBDIV                      CRM_CFG_AHBDIV_Msk                      /*!< AHBDIV[3:0] bits (AHB division) */
#define CRM_CFG_AHBDIV_0                    (0x1U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000010 */
#define CRM_CFG_AHBDIV_1                    (0x2U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000020 */
#define CRM_CFG_AHBDIV_2                    (0x4U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000040 */
#define CRM_CFG_AHBDIV_3                    (0x8U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000080 */

#define CRM_CFG_AHBDIV_DIV1                 0x00000000U                             /*!< SCLK is not divided */
#define CRM_CFG_AHBDIV_DIV2                 0x00000080U                             /*!< SCLK is divided by 2 */
#define CRM_CFG_AHBDIV_DIV4                 0x00000090U                             /*!< SCLK is divided by 4 */
#define CRM_CFG_AHBDIV_DIV8                 0x000000A0U                             /*!< SCLK is divided by 8 */
#define CRM_CFG_AHBDIV_DIV16                0x000000B0U                             /*!< SCLK is divided by 16 */
#define CRM_CFG_AHBDIV_DIV64                0x000000C0U                             /*!< SCLK is divided by 64 */
#define CRM_CFG_AHBDIV_DIV128               0x000000D0U                             /*!< SCLK is divided by 128 */
#define CRM_CFG_AHBDIV_DIV256               0x000000E0U                             /*!< SCLK is divided by 256 */
#define CRM_CFG_AHBDIV_DIV512               0x000000F0U                             /*!< SCLK is divided by 512 */

