HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
#define CRM_CFG_PLLRANGE_Pos                (31U)
#define CRM_CFG_PLLRANGE_Msk                (0x1U << CRM_CFG_PLLRANGE_Pos)          /*!< 0x80000000 */
#define CRM_CFG_PLLRANGE                    CRM_CFG_PLLRANGE_Msk                    /*!< PLL clock output range */

/*!<***************  Bit definition for CRM_CLKINT register  ******************/
#define CRM_CLKINT_LICKSTBLF_Pos            (0U)
#define CRM_CLKINT_LICKSTBLF_Msk            (0x1U << CRM_CLKINT_LICKSTBLF_Pos)      /*!< 0x00000001 */
#define CRM_CLKINT_LICKSTBLF                CRM_CLKINT_LICKSTBLF_Msk                /*!< LICK stable interrupt flag */
#define CRM_CLKINT_LEXTSTBLF_Pos            (1U)
#define CRM_CLKINT_LEXTSTBLF_Msk            (0x1U << CRM_CLKINT_LEXTSTBLF_Pos)      /*!< 0x00000002 */
#define CRM_CLKINT_LEXTSTBLF                CRM_CLKINT_LEXTSTBLF_Msk                /*!< LEXT stable flag */
#define CRM_CLKINT_HICKSTBLF_Pos            (2U)
#define CRM_CLKINT_HICKSTBLF_Msk            (0x1U << CRM_CLKINT_HICKSTBLF_Pos)      /*!< 0x00000004 */
#define CRM_CLKINT_HICKSTBLF                CRM_CLKINT_HICKSTBLF_Msk                /*!< HICK stable flag */
#define CRM_CLKINT_HEXTSTBLF_Pos            (3U)
#define CRM_CLKINT_HEXTSTBLF_Msk            (0x1U << CRM_CLKINT_HEXTSTBLF_Pos)      /*!< 0x00000008 */
#define CRM_CLKINT_HEXTSTBLF                CRM_CLKINT_HEXTSTBLF_Msk                /*!< HEXT stable flag */
#define CRM_CLKINT_PLLSTBLF_Pos             (4U)
#define CRM_CLKINT_PLLSTBLF_Msk             (0x1U << CRM_CLKINT_PLLSTBLF_Pos)       /*!< 0x00000010 */
#define CRM_CLKINT_PLLSTBLF                 CRM_CLKINT_PLLSTBLF_Msk                 /*!< PLL stable flag */
#define CRM_CLKINT_CFDF_Pos                 (7U)
#define CRM_CLKINT_CFDF_Msk                 (0x1U << CRM_CLKINT_CFDF_Pos)           /*!< 0x00000080 */
#define CRM_CLKINT_CFDF                     CRM_CLKINT_CFDF_Msk                     /*!< Clock Failure Detection flag */
#define CRM_CLKINT_LICKSTBLIEN_Pos          (8U)
#define CRM_CLKINT_LICKSTBLIEN_Msk          (0x1U << CRM_CLKINT_LICKSTBLIEN_Pos)    /*!< 0x00000100 */
#define CRM_CLKINT_LICKSTBLIEN              CRM_CLKINT_LICKSTBLIEN_Msk              /*!< LICK stable interrupt enable */
#define CRM_CLKINT_LEXTSTBLIEN_Pos          (9U)
#define CRM_CLKINT_LEXTSTBLIEN_Msk          (0x1U << CRM_CLKINT_LEXTSTBLIEN_Pos)    /*!< 0x00000200 */
#define CRM_CLKINT_LEXTSTBLIEN              CRM_CLKINT_LEXTSTBLIEN_Msk              /*!< LEXT stable interrupt enable */
#define CRM_CLKINT_HICKSTBLIEN_Pos          (10U)
#define CRM_CLKINT_HICKSTBLIEN_Msk          (0x1U << CRM_CLKINT_HICKSTBLIEN_Pos)    /*!< 0x00000400 */
#define CRM_CLKINT_HICKSTBLIEN              CRM_CLKINT_HICKSTBLIEN_Msk              /*!< HICK stable interrupt enable */
#define CRM_CLKINT_HEXTSTBLIEN_Pos          (11U)
#define CRM_CLKINT_HEXTSTBLIEN_Msk          (0x1U << CRM_CLKINT_HEXTSTBLIEN_Pos)    /*!< 0x00000800 */
#define CRM_CLKINT_HEXTSTBLIEN              CRM_CLKINT_HEXTSTBLIEN_Msk              /*!< HEXT stable interrupt enable */
#define CRM_CLKINT_PLLSTBLIEN_Pos           (12U)
#define CRM_CLKINT_PLLSTBLIEN_Msk           (0x1U << CRM_CLKINT_PLLSTBLIEN_Pos)     /*!< 0x00001000 */
#define CRM_CLKINT_PLLSTBLIEN               CRM_CLKINT_PLLSTBLIEN_Msk               /*!< PLL stable interrupt enable */
#define CRM_CLKINT_LICKSTBLFC_Pos           (16U)
#define CRM_CLKINT_LICKSTBLFC_Msk           (0x1U << CRM_CLKINT_LICKSTBLFC_Pos)     /*!< 0x00010000 */
#define CRM_CLKINT_LICKSTBLFC               CRM_CLKINT_LICKSTBLFC_Msk               /*!< LICK stable flag clear */
#define CRM_CLKINT_LEXTSTBLFC_Pos           (17U)
#define CRM_CLKINT_LEXTSTBLFC_Msk           (0x1U << CRM_CLKINT_LEXTSTBLFC_Pos)     /*!< 0x00020000 */
#define CRM_CLKINT_LEXTSTBLFC               CRM_CLKINT_LEXTSTBLFC_Msk               /*!< LEXT stable flag clear */
#define CRM_CLKINT_HICKSTBLFC_Pos           (18U)
#define CRM_CLKINT_HICKSTBLFC_Msk           (0x1U << CRM_CLKINT_HICKSTBLFC_Pos)     /*!< 0x00040000 */
#define CRM_CLKINT_HICKSTBLFC               CRM_CLKINT_HICKSTBLFC_Msk               /*!< HICK stable flag clear */
#define CRM_CLKINT_HEXTSTBLFC_Pos           (19U)
#define CRM_CLKINT_HEXTSTBLFC_Msk           (0x1U << CRM_CLKINT_HEXTSTBLFC_Pos)     /*!< 0x00080000 */
#define CRM_CLKINT_HEXTSTBLFC               CRM_CLKINT_HEXTSTBLFC_Msk               /*!< HEXT stable flag clear */
#define CRM_CLKINT_PLLSTBLFC_Pos            (20U)
#define CRM_CLKINT_PLLSTBLFC_Msk            (0x1U << CRM_CLKINT_PLLSTBLFC_Pos)      /*!< 0x00100000 */
#define CRM_CLKINT_PLLSTBLFC                CRM_CLKINT_PLLSTBLFC_Msk                /*!< PLL stable flag clear */
#define CRM_CLKINT_CFDFC_Pos                (23U)
#define CRM_CLKINT_CFDFC_Msk                (0x1U << CRM_CLKINT_CFDFC_Pos)          /*!< 0x00800000 */
#define CRM_CLKINT_CFDFC                    CRM_CLKINT_CFDFC_Msk                    /*!< Clock failure detection flag clear */

/*****************  Bit definition for CRM_APB2RST register  ******************/
#define CRM_APB2RST_IOMUXRST_Pos            (0U)
#define CRM_APB2RST_IOMUXRST_Msk            (0x1U << CRM_APB2RST_IOMUXRST_Pos)      /*!< 0x00000001 */
#define CRM_APB2RST_IOMUXRST                CRM_APB2RST_IOMUXRST_Msk                /*!< IOMUX reset */
#define CRM_APB2RST_EXINTRST_Pos            (1U)
#define CRM_APB2RST_EXINTRST_Msk            (0x1U << CRM_APB2RST_EXINTRST_Pos)      /*!< 0x00000002 */
#define CRM_APB2RST_EXINTRST                CRM_APB2RST_EXINTRST_Msk                /*!< EXINT reset */
#define CRM_APB2RST_GPIOARST_Pos            (2U)
#define CRM_APB2RST_GPIOARST_Msk            (0x1U << CRM_APB2RST_GPIOARST_Pos)      /*!< 0x00000004 */
#define CRM_APB2RST_GPIOARST                CRM_APB2RST_GPIOARST_Msk                /*!< GPIOA reset */
#define CRM_APB2RST_GPIOBRST_Pos            (3U)
#define CRM_APB2RST_GPIOBRST_Msk            (0x1U << CRM_APB2RST_GPIOBRST_Pos)      /*!< 0x00000008 */
#define CRM_APB2RST_GPIOBRST                CRM_APB2RST_GPIOBRST_Msk                /*!< GPIOB reset */
#define CRM_APB2RST_GPIOCRST_Pos            (4U)
#define CRM_APB2RST_GPIOCRST_Msk            (0x1U << CRM_APB2RST_GPIOCRST_Pos)      /*!< 0x00000010 */
#define CRM_APB2RST_GPIOCRST                CRM_APB2RST_GPIOCRST_Msk                /*!< GPIOC reset */
#define CRM_APB2RST_GPIODRST_Pos            (5U)
#define CRM_APB2RST_GPIODRST_Msk            (0x1U << CRM_APB2RST_GPIODRST_Pos)      /*!< 0x00000020 */
#define CRM_APB2RST_GPIODRST                CRM_APB2RST_GPIODRST_Msk                /*!< GPIOD reset */
#define CRM_APB2RST_GPIOERST_Pos            (6U)
#define CRM_APB2RST_GPIOERST_Msk            (0x1U << CRM_APB2RST_GPIOERST_Pos)      /*!< 0x00000040 */
#define CRM_APB2RST_GPIOERST                CRM_APB2RST_GPIOERST_Msk                /*!< GPIOE reset */
#define CRM_APB2RST_ADC1RST_Pos             (9U)
#define CRM_APB2RST_ADC1RST_Msk             (0x1U << CRM_APB2RST_ADC1RST_Pos)       /*!< 0x00000200 */
#define CRM_APB2RST_ADC1RST                 CRM_APB2RST_ADC1RST_Msk                 /*!< ADC1 reset */
#define CRM_APB2RST_ADC2RST_Pos             (10U)
#define CRM_APB2RST_ADC2RST_Msk             (0x1U << CRM_APB2RST_ADC2RST_Pos)       /*!< 0x00000400 */
#define CRM_APB2RST_ADC2RST                 CRM_APB2RST_ADC2RST_Msk                 /*!< ADC2 reset */
#define CRM_APB2RST_TMR1RST_Pos             (11U)
#define CRM_APB2RST_TMR1RST_Msk             (0x1U << CRM_APB2RST_TMR1RST_Pos)       /*!< 0x00000800 */
#define CRM_APB2RST_TMR1RST                 CRM_APB2RST_TMR1RST_Msk                 /*!< TMR1 reset */
#define CRM_APB2RST_SPI1RST_Pos             (12U)
#define CRM_APB2RST_SPI1RST_Msk             (0x1U << CRM_APB2RST_SPI1RST_Pos)       /*!< 0x00001000 */
#define CRM_APB2RST_SPI1RST                 CRM_APB2RST_SPI1RST_Msk                 /*!< SPI1 reset */
#define CRM_APB2RST_TMR8RST_Pos             (13U)
#define CRM_APB2RST_TMR8RST_Msk             (0x1U << CRM_APB2RST_TMR8RST_Pos)       /*!< 0x00002000 */
#define CRM_APB2RST_TMR8RST                 CRM_APB2RST_TMR8RST_Msk                 /*!< TMR8 reset */
#define CRM_APB2RST_USART1RST_Pos           (14U)
#define CRM_APB2RST_USART1RST_Msk           (0x1U << CRM_APB2RST_USART1RST_Pos)     /*!< 0x00004000 */
#define CRM_APB2RST_USART1RST               CRM_APB2RST_USART1RST_Msk               /*!< USART1 reset */
#define CRM_APB2RST_ADC3RST_Pos             (15U)
#define CRM_APB2RST_ADC3RST_Msk             (0x1U << CRM_APB2RST_ADC3RST_Pos)       /*!< 0x00008000 */
#define CRM_APB2RST_ADC3RST                 CRM_APB2RST_ADC3RST_Msk                 /*!< ADC3 reset */
#define CRM_APB2RST_TMR9RST_Pos             (19U)
#define CRM_APB2RST_TMR9RST_Msk             (0x1U << CRM_APB2RST_TMR9RST_Pos)       /*!< 0x00080000 */
#define CRM_APB2RST_TMR9RST                 CRM_APB2RST_TMR9RST_Msk                 /*!< TMR9 reset */
#define CRM_APB2RST_TMR10RST_Pos            (20U)
#define CRM_APB2RST_TMR10RST_Msk            (0x1U << CRM_APB2RST_TMR10RST_Pos)      /*!< 0x00100000 */
#define CRM_APB2RST_TMR10RST                CRM_APB2RST_TMR10RST_Msk                /*!< TMR10 reset */
#define CRM_APB2RST_TMR11RST_Pos            (21U)
#define CRM_APB2RST_TMR11RST_Msk            (0x1U << CRM_APB2RST_TMR11RST_Pos)      /*!< 0x00200000 */
#define CRM_APB2RST_TMR11RST                CRM_APB2RST_TMR11RST_Msk                /*!< TMR11 reset */
#define CRM_APB2RST_ACCRST_Pos              (22U)
#define CRM_APB2RST_ACCRST_Msk              (0x1U << CRM_APB2RST_ACCRST_Pos)        /*!< 0x00400000 */
#define CRM_APB2RST_ACCRST                  CRM_APB2RST_ACCRST_Msk                  /*!< ACC reset */
#define CRM_APB2RST_I2C3RST_Pos             (23U)
#define CRM_APB2RST_I2C3RST_Msk             (0x1U << CRM_APB2RST_I2C3RST_Pos)       /*!< 0x00800000 */
#define CRM_APB2RST_I2C3RST                 CRM_APB2RST_I2C3RST_Msk                 /*!< I2C3 reset */
#define CRM_APB2RST_USART6RST_Pos           (24U)
#define CRM_APB2RST_USART6RST_Msk           (0x1U << CRM_APB2RST_USART6RST_Pos)     /*!< 0x01000000 */
#define CRM_APB2RST_USART6RST               CRM_APB2RST_USART6RST_Msk               /*!< USART6 reset */
#define CRM_APB2RST_UART7RST_Pos            (25U)
#define CRM_APB2RST_UART7RST_Msk            (0x1U << CRM_APB2RST_UART7RST_Pos)      /*!< 0x02000000 */
#define CRM_APB2RST_UART7RST                CRM_APB2RST_UART7RST_Msk                /*!< UART7 reset */
#define CRM_APB2RST_UART8RST_Pos            (26U)
#define CRM_APB2RST_UART8RST_Msk            (0x1U << CRM_APB2RST_UART8RST_Pos)      /*!< 0x04000000 */
#define CRM_APB2RST_UART8RST                CRM_APB2RST_UART8RST_Msk                /*!< UART8 reset */

/*****************  Bit definition for CRM_APB1RST register  ******************/
#define CRM_APB1RST_TMR2RST_Pos             (0U)
#define CRM_APB1RST_TMR2RST_Msk             (0x1U << CRM_APB1RST_TMR2RST_Pos)       /*!< 0x00000001 */
#define CRM_APB1RST_TMR2RST                 CRM_APB1RST_TMR2RST_Msk                 /*!< TMR2 reset */
#define CRM_APB1RST_TMR3RST_Pos             (1U)
#define CRM_APB1RST_TMR3RST_Msk             (0x1U << CRM_APB1RST_TMR3RST_Pos)       /*!< 0x00000002 */
#define CRM_APB1RST_TMR3RST                 CRM_APB1RST_TMR3RST_Msk                 /*!< TMR3 reset */
#define CRM_APB1RST_TMR4RST_Pos             (2U)
#define CRM_APB1RST_TMR4RST_Msk             (0x1U << CRM_APB1RST_TMR4RST_Pos)       /*!< 0x00000004 */
#define CRM_APB1RST_TMR4RST                 CRM_APB1RST_TMR4RST_Msk                 /*!< TMR4 reset */
#define CRM_APB1RST_TMR5RST_Pos             (3U)
#define CRM_APB1RST_TMR5RST_Msk             (0x1U << CRM_APB1RST_TMR5RST_Pos)       /*!< 0x00000008 */
#define CRM_APB1RST_TMR5RST                 CRM_APB1RST_TMR5RST_Msk                 /*!< TMR5 reset */
#define CRM_APB1RST_TMR6RST_Pos             (4U)
#define CRM_APB1RST_TMR6RST_Msk             (0x1U << CRM_APB1RST_TMR6RST_Pos)       /*!< 0x00000010 */
#define CRM_APB1RST_TMR6RST                 CRM_APB1RST_TMR6RST_Msk                 /*!< TMR6 reset */
#define CRM_APB1RST_TMR7RST_Pos             (5U)
#define CRM_APB1RST_TMR7RST_Msk             (0x1U << CRM_APB1RST_TMR7RST_Pos)       /*!< 0x00000020 */
#define CRM_APB1RST_TMR7RST                 CRM_APB1RST_TMR7RST_Msk                 /*!< TMR7 reset */
#define CRM_APB1RST_TMR12RST_Pos            (6U)
#define CRM_APB1RST_TMR12RST_Msk            (0x1U << CRM_APB1RST_TMR12RST_Pos)      /*!< 0x00000040 */
#define CRM_APB1RST_TMR12RST                CRM_APB1RST_TMR12RST_Msk                /*!< TMR12 reset */
#define CRM_APB1RST_TMR13RST_Pos            (7U)
#define CRM_APB1RST_TMR13RST_Msk            (0x1U << CRM_APB1RST_TMR13RST_Pos)      /*!< 0x00000080 */
#define CRM_APB1RST_TMR13RST                CRM_APB1RST_TMR13RST_Msk                /*!< TMR13 reset */
#define CRM_APB1RST_TMR14RST_Pos            (8U)
#define CRM_APB1RST_TMR14RST_Msk            (0x1U << CRM_APB1RST_TMR14RST_Pos)      /*!< 0x00000100 */
#define CRM_APB1RST_TMR14RST                CRM_APB1RST_TMR14RST_Msk                /*!< TMR14 reset */
#define CRM_APB1RST_WWDTRST_Pos             (11U)
#define CRM_APB1RST_WWDTRST_Msk             (0x1U << CRM_APB1RST_WWDTRST_Pos)       /*!< 0x00000800 */
#define CRM_APB1RST_WWDTRST                 CRM_APB1RST_WWDTRST_Msk                 /*!< WWDT reset */
#define CRM_APB1RST_SPI2RST_Pos             (14U)
#define CRM_APB1RST_SPI2RST_Msk             (0x1U << CRM_APB1RST_SPI2RST_Pos)       /*!< 0x00004000 */
#define CRM_APB1RST_SPI2RST                 CRM_APB1RST_SPI2RST_Msk                 /*!< SPI2 reset */
#define CRM_APB1RST_SPI3RST_Pos             (15U)
#define CRM_APB1RST_SPI3RST_Msk             (0x1U << CRM_APB1RST_SPI3RST_Pos)       /*!< 0x00008000 */
#define CRM_APB1RST_SPI3RST                 CRM_APB1RST_SPI3RST_Msk                 /*!< SPI3 reset */
#define CRM_APB1RST_SPI4RST_Pos             (16U)
#define CRM_APB1RST_SPI4RST_Msk             (0x1U << CRM_APB1RST_SPI4RST_Pos)       /*!< 0x00010000 */
#define CRM_APB1RST_SPI4RST                 CRM_APB1RST_SPI4RST_Msk                 /*!< SPI4 reset */
#define CRM_APB1RST_USART2RST_Pos           (17U)
#define CRM_APB1RST_USART2RST_Msk           (0x1U << CRM_APB1RST_USART2RST_Pos)     /*!< 0x00020000 */
#define CRM_APB1RST_USART2RST               CRM_APB1RST_USART2RST_Msk               /*!< USART2 reset */
#define CRM_APB1RST_USART3RST_Pos           (18U)
#define CRM_APB1RST_USART3RST_Msk           (0x1U << CRM_APB1RST_USART3RST_Pos)     /*!< 0x00040000 */
#define CRM_APB1RST_USART3RST               CRM_APB1RST_USART3RST_Msk               /*!< USART3 reset */
#define CRM_APB1RST_UART4RST_Pos            (19U)
#define CRM_APB1RST_UART4RST_Msk            (0x1U << CRM_APB1RST_UART4RST_Pos)      /*!< 0x00080000 */
#define CRM_APB1RST_UART4RST                CRM_APB1RST_UART4RST_Msk                /*!< UART4 reset */
#define CRM_APB1RST_UART5RST_Pos            (20U)
#define CRM_APB1RST_UART5RST_Msk            (0x1U << CRM_APB1RST_UART5RST_Pos)      /*!< 0x00100000 */
#define CRM_APB1RST_UART5RST                CRM_APB1RST_UART5RST_Msk                /*!< UART5 reset */
#define CRM_APB1RST_I2C1RST_Pos             (21U)
#define CRM_APB1RST_I2C1RST_Msk             (0x1U << CRM_APB1RST_I2C1RST_Pos)       /*!< 0x00200000 */
#define CRM_APB1RST_I2C1RST                 CRM_APB1RST_I2C1RST_Msk                 /*!< I2C1 reset */
#define CRM_APB1RST_I2C2RST_Pos             (22U)
#define CRM_APB1RST_I2C2RST_Msk             (0x1U << CRM_APB1RST_I2C2RST_Pos)       /*!< 0x00400000 */
#define CRM_APB1RST_I2C2RST                 CRM_APB1RST_I2C2RST_Msk                 /*!< I2C2 reset */
#define CRM_APB1RST_USBRST_Pos              (23U)
#define CRM_APB1RST_USBRST_Msk              (0x1U << CRM_APB1RST_USBRST_Pos)        /*!< 0x00800000 */
#define CRM_APB1RST_USBRST                  CRM_APB1RST_USBRST_Msk                  /*!< USB reset */
#define CRM_APB1RST_CAN1RST_Pos             (25U)
#define CRM_APB1RST_CAN1RST_Msk             (0x1U << CRM_APB1RST_CAN1RST_Pos)       /*!< 0x02000000 */
#define CRM_APB1RST_CAN1RST                 CRM_APB1RST_CAN1RST_Msk                 /*!< CAN1 reset */
#define CRM_APB1RST_CAN2RST_Pos             (26U)
#define CRM_APB1RST_CAN2RST_Msk             (0x1U << CRM_APB1RST_CAN1RST_Pos)       /*!< 0x04000000 */
#define CRM_APB1RST_CAN2RST                 CRM_APB1RST_CAN1RST_Msk                 /*!< CAN2 reset */
#define CRM_APB1RST_BPRRST_Pos              (27U)
#define CRM_APB1RST_BPRRST_Msk              (0x1U << CRM_APB1RST_BPRRST_Pos)        /*!< 0x08000000 */
#define CRM_APB1RST_BPRRST                  CRM_APB1RST_BPRRST_Msk                  /*!< Battery powered register reset */
#define CRM_APB1RST_PWCRST_Pos              (28U)
#define CRM_APB1RST_PWCRST_Msk              (0x1U << CRM_APB1RST_PWCRST_Pos)        /*!< 0x10000000 */
#define CRM_APB1RST_PWCRST                  CRM_APB1RST_PWCRST_Msk                  /*!< PWC reset */
#define CRM_APB1RST_DACRST_Pos              (29U)
#define CRM_APB1RST_DACRST_Msk              (0x1U << CRM_APB1RST_DACRST_Pos)        /*!< 0x20000000 */
#define CRM_APB1RST_DACRST                  CRM_APB1RST_DACRST_Msk                  /*!< DAC reset */

/******************  Bit definition for CRM_AHBEN register  *******************/
#define CRM_AHBEN_DMA1EN_Pos                (0U)
#define CRM_AHBEN_DMA1EN_Msk                (0x1U << CRM_AHBEN_DMA1EN_Pos)          /*!< 0x00000001 */
#define CRM_AHBEN_DMA1EN                    CRM_AHBEN_DMA1EN_Msk                    /*!< DMA1 clock enable */
#define CRM_AHBEN_DMA2EN_Pos                (1U)
#define CRM_AHBEN_DMA2EN_Msk                (0x1U << CRM_AHBEN_DMA2EN_Pos)          /*!< 0x00000002 */
#define CRM_AHBEN_DMA2EN                    CRM_AHBEN_DMA2EN_Msk                    /*!< DMA2 clock enable */
#define CRM_AHBEN_SRAMEN_Pos                (2U)
#define CRM_AHBEN_SRAMEN_Msk                (0x1U << CRM_AHBEN_SRAMEN_Pos)          /*!< 0x00000004 */
#define CRM_AHBEN_SRAMEN                    CRM_AHBEN_SRAMEN_Msk                    /*!< SRAM clock enable */
#define CRM_AHBEN_FLASHEN_Pos               (4U)
#define CRM_AHBEN_FLASHEN_Msk               (0x1U << CRM_AHBEN_FLASHEN_Pos)         /*!< 0x00000010 */
#define CRM_AHBEN_FLASHEN                   CRM_AHBEN_FLASHEN_Msk                   /*!< Flash clock enable */
#define CRM_AHBEN_CRCEN_Pos                 (6U)
#define CRM_AHBEN_CRCEN_Msk                 (0x1U << CRM_AHBEN_CRCEN_Pos)           /*!< 0x00000040 */
#define CRM_AHBEN_CRCEN                     CRM_AHBEN_CRCEN_Msk                     /*!< CRC clock enable */
#define CRM_AHBEN_XMCEN_Pos                 (8U)
#define CRM_AHBEN_XMCEN_Msk                 (0x1U << CRM_AHBEN_XMCEN_Pos)           /*!< 0x00000100 */
#define CRM_AHBEN_XMCEN                     CRM_AHBEN_XMCEN_Msk                     /*!< XMC clock enable */
#define CRM_AHBEN_SDIO1EN_Pos               (10U)
#define CRM_AHBEN_SDIO1EN_Msk               (0x1U << CRM_AHBEN_SDIO1EN_Pos)         /*!< 0x00000400 */
#define CRM_AHBEN_SDIO1EN                   CRM_AHBEN_SDIO1EN_Msk                   /*!< SDIO1 clock enable */
#define CRM_AHBEN_SDIO2EN_Pos               (11U)
#define CRM_AHBEN_SDIO2EN_Msk               (0x1U << CRM_AHBEN_SDIO2EN_Pos)         /*!< 0x00000800 */
#define CRM_AHBEN_SDIO2EN                   CRM_AHBEN_SDIO2EN_Msk                   /*!< SDIO2 clock enable */
#define CRM_AHBEN_EMACEN_Pos                (14U)
#define CRM_AHBEN_EMACEN_Msk                (0x1U << CRM_AHBEN_EMACEN_Pos)          /*!< 0x00004000 */
#define CRM_AHBEN_EMACEN                    CRM_AHBEN_EMACEN_Msk                    /*!< Ethernet MAC clock enable */
#define CRM_AHBEN_EMACTXEN_Pos              (15U)
#define CRM_AHBEN_EMACTXEN_Msk              (0x1U << CRM_AHBEN_EMACTXEN_Pos)        /*!< 0x00008000 */
#define CRM_AHBEN_EMACTXEN                  CRM_AHBEN_EMACTXEN_Msk                  /*!< Ethernet MAC TX clock enable */
#define CRM_AHBEN_EMACRXEN_Pos              (16U)
#define CRM_AHBEN_EMACRXEN_Msk              (0x1U << CRM_AHBEN_EMACRXEN_Pos)        /*!< 0x00010000 */
#define CRM_AHBEN_EMACRXEN                  CRM_AHBEN_EMACRXEN_Msk                  /*!< Ethernet MAC RX clock enable */
#define CRM_AHBEN_EMACPTPEN_Pos             (28U)
#define CRM_AHBEN_EMACPTPEN_Msk             (0x1U << CRM_AHBEN_EMACPTPEN_Pos)       /*!< 0x10000000 */
#define CRM_AHBEN_EMACPTPEN                 CRM_AHBEN_EMACPTPEN_Msk                 /*!< Ethernet MAC PTP clock enable */

