HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
#define GPIO_CFGLR_IOMC3_Pos                (12U)
#define GPIO_CFGLR_IOMC3_Msk                (0x3U << GPIO_CFGLR_IOMC3_Pos)          /*!< 0x00003000 */
#define GPIO_CFGLR_IOMC3                    GPIO_CFGLR_IOMC3_Msk                    /*!< IOMC3[1:0] bits (GPIO x mode configuration, pin 3) */
#define GPIO_CFGLR_IOMC3_0                  (0x1U << GPIO_CFGLR_IOMC3_Pos)          /*!< 0x00001000 */
#define GPIO_CFGLR_IOMC3_1                  (0x2U << GPIO_CFGLR_IOMC3_Pos)          /*!< 0x00002000 */

#define GPIO_CFGLR_IOMC4_Pos                (16U)
#define GPIO_CFGLR_IOMC4_Msk                (0x3U << GPIO_CFGLR_IOMC4_Pos)          /*!< 0x00030000 */
#define GPIO_CFGLR_IOMC4                    GPIO_CFGLR_IOMC4_Msk                    /*!< IOMC4[1:0] bits (GPIO x mode configuration, pin 4) */
#define GPIO_CFGLR_IOMC4_0                  (0x1U << GPIO_CFGLR_IOMC4_Pos)          /*!< 0x00010000 */
#define GPIO_CFGLR_IOMC4_1                  (0x2U << GPIO_CFGLR_IOMC4_Pos)          /*!< 0x00020000 */

#define GPIO_CFGLR_IOMC5_Pos                (20U)
#define GPIO_CFGLR_IOMC5_Msk                (0x3U << GPIO_CFGLR_IOMC5_Pos)          /*!< 0x00300000 */
#define GPIO_CFGLR_IOMC5                    GPIO_CFGLR_IOMC5_Msk                    /*!< IOMC5[1:0] bits (GPIO x mode configuration, pin 5) */
#define GPIO_CFGLR_IOMC5_0                  (0x1U << GPIO_CFGLR_IOMC5_Pos)          /*!< 0x00100000 */
#define GPIO_CFGLR_IOMC5_1                  (0x2U << GPIO_CFGLR_IOMC5_Pos)          /*!< 0x00200000 */

#define GPIO_CFGLR_IOMC6_Pos                (24U)
#define GPIO_CFGLR_IOMC6_Msk                (0x3U << GPIO_CFGLR_IOMC6_Pos)          /*!< 0x03000000 */
#define GPIO_CFGLR_IOMC6                    GPIO_CFGLR_IOMC6_Msk                    /*!< IOMC6[1:0] bits (GPIO x mode configuration, pin 6) */
#define GPIO_CFGLR_IOMC6_0                  (0x1U << GPIO_CFGLR_IOMC6_Pos)          /*!< 0x01000000 */
#define GPIO_CFGLR_IOMC6_1                  (0x2U << GPIO_CFGLR_IOMC6_Pos)          /*!< 0x02000000 */

#define GPIO_CFGLR_IOMC7_Pos                (28U)
#define GPIO_CFGLR_IOMC7_Msk                (0x3U << GPIO_CFGLR_IOMC7_Pos)          /*!< 0x30000000 */
#define GPIO_CFGLR_IOMC7                    GPIO_CFGLR_IOMC7_Msk                    /*!< IOMC7[1:0] bits (GPIO x mode configuration, pin 7) */
#define GPIO_CFGLR_IOMC7_0                  (0x1U << GPIO_CFGLR_IOMC7_Pos)          /*!< 0x10000000 */
#define GPIO_CFGLR_IOMC7_1                  (0x2U << GPIO_CFGLR_IOMC7_Pos)          /*!< 0x20000000 */

#define GPIO_CFGLR_IOFC_Pos                 (2U)
#define GPIO_CFGLR_IOFC_Msk                 (0x33333333U << GPIO_CFGLR_IOFC_Pos)    /*!< 0xCCCCCCCC */
#define GPIO_CFGLR_IOFC                     GPIO_CFGLR_IOFC_Msk                     /*!< GPIO x function configuration */

#define GPIO_CFGLR_IOFC0_Pos                (2U)
#define GPIO_CFGLR_IOFC0_Msk                (0x3U << GPIO_CFGLR_IOFC0_Pos)          /*!< 0x0000000C */
#define GPIO_CFGLR_IOFC0                    GPIO_CFGLR_IOFC0_Msk                    /*!< IOFC0[1:0] bits (GPIO x function configuration, pin 0) */
#define GPIO_CFGLR_IOFC0_0                  (0x1U << GPIO_CFGLR_IOFC0_Pos)          /*!< 0x00000004 */
#define GPIO_CFGLR_IOFC0_1                  (0x2U << GPIO_CFGLR_IOFC0_Pos)          /*!< 0x00000008 */

#define GPIO_CFGLR_IOFC1_Pos                (6U)
#define GPIO_CFGLR_IOFC1_Msk                (0x3U << GPIO_CFGLR_IOFC1_Pos)          /*!< 0x000000C0 */
#define GPIO_CFGLR_IOFC1                    GPIO_CFGLR_IOFC1_Msk                    /*!< IOFC1[1:0] bits (GPIO x function configuration, pin 1) */
#define GPIO_CFGLR_IOFC1_0                  (0x1U << GPIO_CFGLR_IOFC1_Pos)          /*!< 0x00000040 */
#define GPIO_CFGLR_IOFC1_1                  (0x2U << GPIO_CFGLR_IOFC1_Pos)          /*!< 0x00000080 */

#define GPIO_CFGLR_IOFC2_Pos                (10U)
#define GPIO_CFGLR_IOFC2_Msk                (0x3U << GPIO_CFGLR_IOFC2_Pos)          /*!< 0x00000C00 */
#define GPIO_CFGLR_IOFC2                    GPIO_CFGLR_IOFC2_Msk                    /*!< IOFC2[1:0] bits (GPIO x function configuration, pin 2) */
#define GPIO_CFGLR_IOFC2_0                  (0x1U << GPIO_CFGLR_IOFC2_Pos)          /*!< 0x00000400 */
#define GPIO_CFGLR_IOFC2_1                  (0x2U << GPIO_CFGLR_IOFC2_Pos)          /*!< 0x00000800 */

#define GPIO_CFGLR_IOFC3_Pos                (14U)
#define GPIO_CFGLR_IOFC3_Msk                (0x3U << GPIO_CFGLR_IOFC3_Pos)          /*!< 0x0000C000 */
#define GPIO_CFGLR_IOFC3                    GPIO_CFGLR_IOFC3_Msk                    /*!< IOFC3[1:0] bits (GPIO x function configuration, pin 3) */
#define GPIO_CFGLR_IOFC3_0                  (0x1U << GPIO_CFGLR_IOFC3_Pos)          /*!< 0x00004000 */
#define GPIO_CFGLR_IOFC3_1                  (0x2U << GPIO_CFGLR_IOFC3_Pos)          /*!< 0x00008000 */

#define GPIO_CFGLR_IOFC4_Pos                (18U)
#define GPIO_CFGLR_IOFC4_Msk                (0x3U << GPIO_CFGLR_IOFC4_Pos)          /*!< 0x000C0000 */
#define GPIO_CFGLR_IOFC4                    GPIO_CFGLR_IOFC4_Msk                    /*!< IOFC4[1:0] bits (GPIO x function configuration, pin 4) */
#define GPIO_CFGLR_IOFC4_0                  (0x1U << GPIO_CFGLR_IOFC4_Pos)          /*!< 0x00040000 */
#define GPIO_CFGLR_IOFC4_1                  (0x2U << GPIO_CFGLR_IOFC4_Pos)          /*!< 0x00080000 */

#define GPIO_CFGLR_IOFC5_Pos                (22U)
#define GPIO_CFGLR_IOFC5_Msk                (0x3U << GPIO_CFGLR_IOFC5_Pos)          /*!< 0x00C00000 */
#define GPIO_CFGLR_IOFC5                    GPIO_CFGLR_IOFC5_Msk                    /*!< IOFC5[1:0] bits (GPIO x function configuration, pin 5) */
#define GPIO_CFGLR_IOFC5_0                  (0x1U << GPIO_CFGLR_IOFC5_Pos)          /*!< 0x00400000 */
#define GPIO_CFGLR_IOFC5_1                  (0x2U << GPIO_CFGLR_IOFC5_Pos)          /*!< 0x00800000 */

#define GPIO_CFGLR_IOFC6_Pos                (26U)
#define GPIO_CFGLR_IOFC6_Msk                (0x3U << GPIO_CFGLR_IOFC6_Pos)          /*!< 0x0C000000 */
#define GPIO_CFGLR_IOFC6                    GPIO_CFGLR_IOFC6_Msk                    /*!< IOFC6[1:0] bits (GPIO x function configuration, pin 6) */
#define GPIO_CFGLR_IOFC6_0                  (0x1U << GPIO_CFGLR_IOFC6_Pos)          /*!< 0x04000000 */
#define GPIO_CFGLR_IOFC6_1                  (0x2U << GPIO_CFGLR_IOFC6_Pos)          /*!< 0x08000000 */

