HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
#define IOMUX_REMAP_USART3_MUX_MUX1         0x00000000U                             /*!< TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14 */
#define IOMUX_REMAP_USART3_MUX_MUX2_Pos     (4U)                                    /*!< 0x00000010 */
#define IOMUX_REMAP_USART3_MUX_MUX2_Msk     (0x1U << IOMUX_REMAP_USART3_MUX_MUX2_Pos)
#define IOMUX_REMAP_USART3_MUX_MUX2         IOMUX_REMAP_USART3_MUX_MUX2_Msk         /*!< TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14 */
#define IOMUX_REMAP_USART3_MUX_MUX3_Pos     (4U)                                    /*!< 0x00000030 */
#define IOMUX_REMAP_USART3_MUX_MUX3_Msk     (0x3U << IOMUX_REMAP_USART3_MUX_MUX3_Pos)
#define IOMUX_REMAP_USART3_MUX_MUX3         IOMUX_REMAP_USART3_MUX_MUX3_Msk         /*!< TX/PD8, RX/PD9, CK/PD10, CTS/PD11, RTS/PD12 */

/*!< TMR1_MUX configuration */
#define IOMUX_REMAP_TMR1_MUX_Pos            (6U)
#define IOMUX_REMAP_TMR1_MUX_Msk            (0x3U << IOMUX_REMAP_TMR1_MUX_Pos)      /*!< 0x000000C0 */
#define IOMUX_REMAP_TMR1_MUX                IOMUX_REMAP_TMR1_MUX_Msk                /*!< TMR1_MUX[1:0] bits (TMR1 IO multiplexing) */
#define IOMUX_REMAP_TMR1_MUX_0              (0x1U << IOMUX_REMAP_TMR1_MUX_Pos)      /*!< 0x00000040 */
#define IOMUX_REMAP_TMR1_MUX_1              (0x2U << IOMUX_REMAP_TMR1_MUX_Pos       /*!< 0x00000080 */

#define IOMUX_REMAP_TMR1_MUX_MUX1           0x00000000U                             /*!< EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PB12, CH1C/PB13, CH2C/PB14, CH3C/PB15 */
#define IOMUX_REMAP_TMR1_MUX_MUX2_Pos       (6U)
#define IOMUX_REMAP_TMR1_MUX_MUX2_Msk       (0x1U << IOMUX_REMAP_TMR1_MUX_MUX2_Pos) /*!< 0x00000040 */
#define IOMUX_REMAP_TMR1_MUX_MUX2           IOMUX_REMAP_TMR1_MUX_MUX2_Msk           /*!< EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PA6, CH1C/PA7, CH2C/PB0, CH3C/PB1 */
#define IOMUX_REMAP_TMR1_MUX_MUX3_Pos       (6U)
#define IOMUX_REMAP_TMR1_MUX_MUX3_Msk       (0x3U << IOMUX_REMAP_TMR1_MUX_MUX3_Pos) /*!< 0x000000C0 */
#define IOMUX_REMAP_TMR1_MUX_MUX3           IOMUX_REMAP_TMR1_MUX_MUX3_Msk           /*!< EXT/PE7, CH1/PE9, CH2/PE11, CH3/PE13, CH4/PE14, BRK/PE15, CH1C/PE8, CH2C/PE10, CH3C/PE12 */

/*!< TMR2_MUX configuration */
#define IOMUX_REMAP_TMR2_MUX_Pos            (8U)
#define IOMUX_REMAP_TMR2_MUX_Msk            (0x3U << IOMUX_REMAP_TMR2_MUX_Pos)      /*!< 0x00000300 */
#define IOMUX_REMAP_TMR2_MUX                IOMUX_REMAP_TMR2_MUX_Msk                /*!< TMR2_MUX[1:0] bits (TMR2 IO multiplexing) */
#define IOMUX_REMAP_TMR2_MUX_0              (0x1U << IOMUX_REMAP_TMR2_MUX_Pos)      /*!< 0x00000100 */
#define IOMUX_REMAP_TMR2_MUX_1              (0x2U << IOMUX_REMAP_TMR2_MUX_Pos)      /*!< 0x00000200 */

#define IOMUX_REMAP_TMR2_MUX_MUX1           0x00000000U                             /*!< CH1/EXT/PA0, CH2/PA1, CH3/PA2, CH4/PA3 */
#define IOMUX_REMAP_TMR2_MUX_MUX2_Pos       (8U)
#define IOMUX_REMAP_TMR2_MUX_MUX2_Msk       (0x1U << IOMUX_REMAP_TMR2_MUX_MUX2_Pos) /*!< 0x00000100 */
#define IOMUX_REMAP_TMR2_MUX_MUX2           IOMUX_REMAP_TMR2_MUX_MUX2_Msk           /*!< CH1/EXT/PA15, CH2/PB3, CH3/PA2, CH4/PA3 */
#define IOMUX_REMAP_TMR2_MUX_MUX3_Pos       (9U)
#define IOMUX_REMAP_TMR2_MUX_MUX3_Msk       (0x1U << IOMUX_REMAP_TMR2_MUX_MUX3_Pos) /*!< 0x00000200 */
#define IOMUX_REMAP_TMR2_MUX_MUX3           IOMUX_REMAP_TMR2_MUX_MUX3_Msk           /*!< CH1/EXT/PA0, CH2/PA1, CH3/PB10, CH4/PB11 */
#define IOMUX_REMAP_TMR2_MUX_MUX4_Pos       (8U)
#define IOMUX_REMAP_TMR2_MUX_MUX4_Msk       (0x3U << IOMUX_REMAP_TMR2_MUX_MUX4_Pos) /*!< 0x00000300 */
#define IOMUX_REMAP_TMR2_MUX_MUX4           IOMUX_REMAP_TMR2_MUX_MUX4_Msk           /*!< CH1/EXT/PA15, CH2/PB3, CH3/PB10, CH4/PB11 */

/*!< TMR3_MUX configuration */
#define IOMUX_REMAP_TMR3_MUX_Pos            (10U)
#define IOMUX_REMAP_TMR3_MUX_Msk            (0x3U << IOMUX_REMAP_TMR3_MUX_Pos)      /*!< 0x00000C00 */
#define IOMUX_REMAP_TMR3_MUX                IOMUX_REMAP_TMR3_MUX_Msk                /*!< TMR3_MUX[1:0] bits (TMR3 IO multiplexing) */
#define IOMUX_REMAP_TMR3_MUX_0              (0x1U << IOMUX_REMAP_TMR3_MUX_Pos)      /*!< 0x00000400 */
#define IOMUX_REMAP_TMR3_MUX_1              (0x2U << IOMUX_REMAP_TMR3_MUX_Pos)      /*!< 0x00000800 */

#define IOMUX_REMAP_TMR3_MUX_MUX1           0x00000000U                             /*!< CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1 */
#define IOMUX_REMAP_TMR3_MUX_MUX2_Pos       (11U)
#define IOMUX_REMAP_TMR3_MUX_MUX2_Msk       (0x1U << IOMUX_REMAP_TMR3_MUX_MUX2_Pos) /*!< 0x00000800 */
#define IOMUX_REMAP_TMR3_MUX_MUX2           IOMUX_REMAP_TMR3_MUX_MUX2_Msk           /*!< CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1 */
#define IOMUX_REMAP_TMR3_MUX_MUX3_Pos       (10U)
#define IOMUX_REMAP_TMR3_MUX_MUX3_Msk       (0x3U << IOMUX_REMAP_TMR3_MUX_MUX3_Pos) /*!< 0x00000C00 */
#define IOMUX_REMAP_TMR3_MUX_MUX3           IOMUX_REMAP_TMR3_MUX_MUX3_Msk           /*!< CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9 */

#define IOMUX_REMAP_TMR4_MUX_Pos            (12U)
#define IOMUX_REMAP_TMR4_MUX_Msk            (0x1U << IOMUX_REMAP_TMR4_MUX_Pos)      /*!< 0x00001000 */
#define IOMUX_REMAP_TMR4_MUX                IOMUX_REMAP_TMR4_MUX_Msk                /*!< TMR4 IO multiplexing */

/*!< CAN_MUX configuration */
#define IOMUX_REMAP_CAN_MUX_Pos             (13U)
#define IOMUX_REMAP_CAN_MUX_Msk             (0x3U << IOMUX_REMAP_CAN_MUX_Pos)       /*!< 0x00006000 */
#define IOMUX_REMAP_CAN_MUX                 IOMUX_REMAP_CAN_MUX_Msk                 /*!< CAN_MUX[1:0] bits (CAN IO multiplexing) */
#define IOMUX_REMAP_CAN_MUX_0               (0x1U << IOMUX_REMAP_CAN_MUX_Pos)       /*!< 0x00002000 */
#define IOMUX_REMAP_CAN_MUX_1               (0x2U << IOMUX_REMAP_CAN_MUX_Pos)       /*!< 0x00004000 */

#define IOMUX_REMAP_CAN_MUX_MUX1            0x00000000U                             /*!< RX/PA11, TX/PA12 */
#define IOMUX_REMAP_CAN_MUX_MUX2_Pos        (14U)
#define IOMUX_REMAP_CAN_MUX_MUX2_Msk        (0x1U << IOMUX_REMAP_CAN_MUX_MUX2_Pos)  /*!< 0x00004000 */
#define IOMUX_REMAP_CAN_MUX_MUX2            IOMUX_REMAP_CAN_MUX_MUX2_Msk            /*!< RX/PB8, TX/PB9 */
#define IOMUX_REMAP_CAN_MUX_MUX3_Pos        (13U)
#define IOMUX_REMAP_CAN_MUX_MUX3_Msk        (0x3U << IOMUX_REMAP_CAN_MUX_MUX3_Pos)  /*!< 0x00006000 */
#define IOMUX_REMAP_CAN_MUX_MUX3            IOMUX_REMAP_CAN_MUX_MUX3_Msk            /*!< RX/PD0, TX/PD1 */

#define IOMUX_REMAP_PD01_MUX_Pos            (15U)
#define IOMUX_REMAP_PD01_MUX_Msk            (0x1U << IOMUX_REMAP_PD01_MUX_Pos)      /*!< 0x00008000 */
#define IOMUX_REMAP_PD01_MUX                IOMUX_REMAP_PD01_MUX_Msk                /*!< PD0/PD1 mapped on HEXT_IN/HEXT_OUT */
#define IOMUX_REMAP_TMR5CH4_MUX_Pos         (16U)
#define IOMUX_REMAP_TMR5CH4_MUX_Msk         (0x1U << IOMUX_REMAP_TMR5CH4_MUX_Pos)   /*!< 0x00010000 */
#define IOMUX_REMAP_TMR5CH4_MUX             IOMUX_REMAP_TMR5CH4_MUX_Msk             /*!< TMR5 channel 4 multiplexing */
#define IOMUX_REMAP_ADC1_ETP_MUX_Pos        (17U)
#define IOMUX_REMAP_ADC1_ETP_MUX_Msk        (0x1U << IOMUX_REMAP_ADC1_ETP_MUX_Pos)  /*!< 0x00020000 */
#define IOMUX_REMAP_ADC1_ETP_MUX            IOMUX_REMAP_ADC1_ETP_MUX_Msk            /*!< ADC1 external trigger preempted conversion multiplexing */
#define IOMUX_REMAP_ADC1_ETO_MUX_Pos        (18U)
#define IOMUX_REMAP_ADC1_ETO_MUX_Msk        (0x1U << IOMUX_REMAP_ADC1_ETO_MUX_Pos)  /*!< 0x00040000 */
#define IOMUX_REMAP_ADC1_ETO_MUX            IOMUX_REMAP_ADC1_ETO_MUX_Msk            /*!< ADC1 external trigger regular conversion mutiplexing */
#define IOMUX_REMAP_ADC2_ETP_MUX_Pos        (19U)
#define IOMUX_REMAP_ADC2_ETP_MUX_Msk        (0x1U << IOMUX_REMAP_ADC2_ETP_MUX_Pos)  /*!< 0x00080000 */
#define IOMUX_REMAP_ADC2_ETP_MUX            IOMUX_REMAP_ADC2_ETP_MUX_Msk            /*!< ADC2 external trigger preempted conversion mutiplexing */
#define IOMUX_REMAP_ADC2_ETO_MUX_Pos        (20U)
#define IOMUX_REMAP_ADC2_ETO_MUX_Msk        (0x1U << IOMUX_REMAP_ADC2_ETO_MUX_Pos)  /*!< 0x00100000 */
#define IOMUX_REMAP_ADC2_ETO_MUX            IOMUX_REMAP_ADC2_ETO_MUX_Msk            /*!< ADC2 external trigger ordinary conversion multiplexing */
#define IOMUX_REMAP_EMAC_MUX_Pos            (21U)
#define IOMUX_REMAP_EMAC_MUX_Msk            (0x1U << IOMUX_REMAP_EMAC_MUX_Pos)      /*!< 0x00200000 */
#define IOMUX_REMAP_EMAC_MUX                IOMUX_REMAP_EMAC_MUX_Msk                /*!< EMAC IO multiplexing */
#define IOMUX_REMAP_CAN2_MUX_Pos            (22U)
#define IOMUX_REMAP_CAN2_MUX_Msk            (0x1U << IOMUX_REMAP_CAN2_MUX_Pos)      /*!< 0x00400000 */
#define IOMUX_REMAP_CAN2_MUX                IOMUX_REMAP_CAN2_MUX_Msk                /*!< CAN2 IO multiplexing */
#define IOMUX_REMAP_MII_RMII_SEL_Pos        (23U)
#define IOMUX_REMAP_MII_RMII_SEL_Msk        (0x1U << IOMUX_REMAP_MII_RMII_SEL_Pos)  /*!< 0x00800000 */
#define IOMUX_REMAP_MII_RMII_SEL            IOMUX_REMAP_MII_RMII_SEL_Msk            /*!< MII or RMII selection */

/*!< SWJTAG_MUX configuration */
#define IOMUX_REMAP_SWJTAG_MUX_Pos          (24U)
#define IOMUX_REMAP_SWJTAG_MUX_Msk          (0x7U << IOMUX_REMAP_SWJTAG_MUX_Pos)    /*!< 0x07000000 */
#define IOMUX_REMAP_SWJTAG_MUX              IOMUX_REMAP_SWJTAG_MUX_Msk              /*!< SWJTAG_MUX[2:0] bits (SWD JTAG mutiplexing) */
#define IOMUX_REMAP_SWJTAG_MUX_0            (0x1U << IOMUX_REMAP_SWJTAG_MUX_Pos)    /*!< 0x01000000 */
#define IOMUX_REMAP_SWJTAG_MUX_1            (0x2U << IOMUX_REMAP_SWJTAG_MUX_Pos)    /*!< 0x02000000 */
#define IOMUX_REMAP_SWJTAG_MUX_2            (0x4U << IOMUX_REMAP_SWJTAG_MUX_Pos)    /*!< 0x04000000 */

#define IOMUX_REMAP_SWJTAG_MUX_RESET        0x00000000U                             /*!< Supports SWD and JTAG. All SWJTAG pins cannot be used as GPIOs */
#define IOMUX_REMAP_SWJTAG_MUX_NONJTRST_Pos (24U)                                   /*!< 0x01000000 */
#define IOMUX_REMAP_SWJTAG_MUX_NONJTRST_Msk (0x1U << IOMUX_REMAP_SWJTAG_MUX_NONJTRST_Pos)
#define IOMUX_REMAP_SWJTAG_MUX_NONJTRST     IOMUX_REMAP_SWJTAG_MUX_NONJTRST_Msk     /*!< Supports SWD and JTAG. NJTRST is disabled. PB4 can be used as GPIO */
#define IOMUX_REMAP_SWJTAG_MUX_JTAGDIS_Pos  (25U)                                   /*!< 0x02000000 */
#define IOMUX_REMAP_SWJTAG_MUX_JTAGDIS_Msk  (0x1U << IOMUX_REMAP_SWJTAG_MUX_JTAGDIS_Pos)
#define IOMUX_REMAP_SWJTAG_MUX_JTAGDIS      IOMUX_REMAP_SWJTAG_MUX_JTAGDIS_Msk      /*!< Supports SWD but JTAG is disabled. PA15/PB3/PB4 can be used as GPIOs */
#define IOMUX_REMAP_SWJTAG_MUX_DISABLE_Pos  (26U)                                   /*!< 0x04000000 */
#define IOMUX_REMAP_SWJTAG_MUX_DISABLE_Msk  (0x1U << IOMUX_REMAP_SWJTAG_MUX_DISABLE_Pos)
#define IOMUX_REMAP_SWJTAG_MUX_DISABLE      IOMUX_REMAP_SWJTAG_MUX_DISABLE_Msk      /*!< SWD and JTAG are disabled. All SWJTAG pins can be used as GPIOs */

