HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
#define IOMUX_REMAP2_SPIM_EN_Pos            (21U)
#define IOMUX_REMAP2_SPIM_EN_Msk            (0x1U << IOMUX_REMAP2_SPIM_EN_Pos)      /*!< 0x00200000 */
#define IOMUX_REMAP2_SPIM_EN                IOMUX_REMAP2_SPIM_EN_Msk                /*!< SPIM enable */

/*****************  Bit definition for IOMUX_REMAP3 register  *****************/
#define IOMUX_REMAP3_TMR9_GMUX_Pos          (0U)
#define IOMUX_REMAP3_TMR9_GMUX_Msk          (0xFU << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x0000000F */
#define IOMUX_REMAP3_TMR9_GMUX              IOMUX_REMAP3_TMR9_GMUX_Msk              /*!< TMR9_GMUX[3:0] bits (TMR9 IO general multiplexing) */
#define IOMUX_REMAP3_TMR9_GMUX_0            (0x1U << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x00000001 */
#define IOMUX_REMAP3_TMR9_GMUX_1            (0x2U << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x00000002 */
#define IOMUX_REMAP3_TMR9_GMUX_2            (0x4U << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x00000004 */
#define IOMUX_REMAP3_TMR9_GMUX_3            (0x8U << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x00000008 */

/*****************  Bit definition for IOMUX_REMAP4 register  *****************/
/*!< TMR1_GMUX configuration */
#define IOMUX_REMAP4_TMR1_GMUX_Pos          (0U)
#define IOMUX_REMAP4_TMR1_GMUX_Msk          (0xFU << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x0000000F */
#define IOMUX_REMAP4_TMR1_GMUX              IOMUX_REMAP4_TMR1_GMUX_Msk              /*!< TMR1_GMUX[3:0] bits (TMR1 IO general multiplexing) */
#define IOMUX_REMAP4_TMR1_GMUX_0            (0x1U << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x00000001 */
#define IOMUX_REMAP4_TMR1_GMUX_1            (0x2U << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x00000002 */
#define IOMUX_REMAP4_TMR1_GMUX_2            (0x4U << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x00000004 */
#define IOMUX_REMAP4_TMR1_GMUX_3            (0x8U << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x00000008 */

#define IOMUX_REMAP4_TMR1_GMUX_MUX1         0x00000000U                             /*!< EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PB12, CH1C/PB13, CH2C/PB14, CH3C/PB15 */
#define IOMUX_REMAP4_TMR1_GMUX_MUX2_Pos     (0U)                                    /*!< 0x00000001 */
#define IOMUX_REMAP4_TMR1_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP4_TMR1_GMUX_MUX2_Pos)
#define IOMUX_REMAP4_TMR1_GMUX_MUX2         IOMUX_REMAP4_TMR1_GMUX_MUX2_Msk         /*!< EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PA6, CH1C/PA7, CH2C/PB0, CH3C/PB1 */
#define IOMUX_REMAP4_TMR1_GMUX_MUX3_Pos     (0U)                                    /*!< 0x00000003 */
#define IOMUX_REMAP4_TMR1_GMUX_MUX3_Msk     (0x3U << IOMUX_REMAP4_TMR1_GMUX_MUX3_Pos)
#define IOMUX_REMAP4_TMR1_GMUX_MUX3         IOMUX_REMAP4_TMR1_GMUX_MUX3_Msk         /*!< EXT/PE7, CH1/PE9, CH2/PE11, CH3/PE13, CH4/PE14, BRK/PE15, CH1C/PE8, CH2C/PE10, CH3C/PE12 */

/*!< TMR2_GMUX configuration */
#define IOMUX_REMAP4_TMR2_GMUX_Pos          (4U)
#define IOMUX_REMAP4_TMR2_GMUX_Msk          (0x3U << IOMUX_REMAP4_TMR2_GMUX_Pos)    /*!< 0x00000030 */
#define IOMUX_REMAP4_TMR2_GMUX              IOMUX_REMAP4_TMR2_GMUX_Msk              /*!< TMR2_GMUX[1:0] bits (TMR2 IO general multiplexing) */
#define IOMUX_REMAP4_TMR2_GMUX_0            (0x1U << IOMUX_REMAP4_TMR2_GMUX_Pos)    /*!< 0x00000010 */
#define IOMUX_REMAP4_TMR2_GMUX_1            (0x2U << IOMUX_REMAP4_TMR2_GMUX_Pos)    /*!< 0x00000020 */

#define IOMUX_REMAP4_TMR2_GMUX_MUX1         0x00000000U                             /*!< CH1_EXT/PA0, CH2/PA1, CH3/PA2, CH4/PA3 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX2_Pos     (4U)                                    /*!< 0x00000010 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP4_TMR2_GMUX_MUX2_Pos)
#define IOMUX_REMAP4_TMR2_GMUX_MUX2         IOMUX_REMAP4_TMR2_GMUX_MUX2_Msk         /*!< CH1_EXT/PA15, CH2/PB3, CH3/PA2, CH4/PA3 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX3_Pos     (5U)                                    /*!< 0x00000020 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX3_Msk     (0x1U << IOMUX_REMAP4_TMR2_GMUX_MUX3_Pos)
#define IOMUX_REMAP4_TMR2_GMUX_MUX3         IOMUX_REMAP4_TMR2_GMUX_MUX3_Msk         /*!< CH1_EXT/PA0, CH2/PA1, CH3/PB10, CH4/PB11 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX4_Pos     (4U)                                    /*!< 0x00000030 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX4_Msk     (0x3U << IOMUX_REMAP4_TMR2_GMUX_MUX4_Pos)
#define IOMUX_REMAP4_TMR2_GMUX_MUX4         IOMUX_REMAP4_TMR2_GMUX_MUX4_Msk         /*!< CH1_EXT/PA15, CH2/PB3, CH3/PB10, CH4/PB11 */

/*!< TMR2ITR1_GMUX configuration */
#define IOMUX_REMAP4_TMR2ITR1_GMUX_Pos      (6U)
#define IOMUX_REMAP4_TMR2ITR1_GMUX_Msk      (0x3U << IOMUX_REMAP4_TMR2ITR1_GMUX_Pos) /*!< 0x000000C0 */
#define IOMUX_REMAP4_TMR2ITR1_GMUX          IOMUX_REMAP4_TMR2ITR1_GMUX_Msk           /*!< TMR2ITR1_GMUX[1:0] bits (TMR2 internal trigger 1 general multiplexing) */
#define IOMUX_REMAP4_TMR2ITR1_GMUX_0        (0x1U << IOMUX_REMAP4_TMR2ITR1_GMUX_Pos) /*!< 0x00000040 */
#define IOMUX_REMAP4_TMR2ITR1_GMUX_1        (0x2U << IOMUX_REMAP4_TMR2ITR1_GMUX_Pos) /*!< 0x00000080 */

#define IOMUX_REMAP4_TMR2ITR1_GMUX_MUX1     0x00000000U                             /*!< TMR8_TRGO is used as input source of TMR2_ITR1 */
#define IOMUX_REMAP4_TMR2ITR1_GMUX_MUX2_Pos (7U)                                    /*!< 0x00000080 */
#define IOMUX_REMAP4_TMR2ITR1_GMUX_MUX2_Msk (0x1U << IOMUX_REMAP4_TMR2ITR1_GMUX_MUX2_Pos)
#define IOMUX_REMAP4_TMR2ITR1_GMUX_MUX2     IOMUX_REMAP4_TMR2ITR1_GMUX_MUX2_Msk     /*!< Ethernet PTP output to TMR2_ITR1 */
#define IOMUX_REMAP4_TMR2ITR1_GMUX_MUX3_Pos (6U)                                    /*!< 0x000000C0 */
#define IOMUX_REMAP4_TMR2ITR1_GMUX_MUX3_Msk (0x3U << IOMUX_REMAP4_TMR2ITR1_GMUX_MUX3_Pos)
#define IOMUX_REMAP4_TMR2ITR1_GMUX_MUX3     IOMUX_REMAP4_TMR2ITR1_GMUX_MUX3_Msk     /*!< SB SOF is used as input source of TMR2_ITR1 */

#define IOMUX_REMAP4_TMR3_GMUX_Pos          (8U)
#define IOMUX_REMAP4_TMR3_GMUX_Msk          (0xFU << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000F00 */
#define IOMUX_REMAP4_TMR3_GMUX              IOMUX_REMAP4_TMR3_GMUX_Msk              /*!< TMR3_GMUX[3:0] bits (TMR3 IO general multiplexing) */
#define IOMUX_REMAP4_TMR3_GMUX_0            (0x1U << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000100 */
#define IOMUX_REMAP4_TMR3_GMUX_1            (0x2U << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000200 */
#define IOMUX_REMAP4_TMR3_GMUX_2            (0x4U << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000400 */
#define IOMUX_REMAP4_TMR3_GMUX_3            (0x8U << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000800 */

#define IOMUX_REMAP4_TMR4_GMUX_Pos          (12U)
#define IOMUX_REMAP4_TMR4_GMUX_Msk          (0xFU << IOMUX_REMAP4_TMR4_GMUX_Pos)    /*!< 0x0000F000 */
#define IOMUX_REMAP4_TMR4_GMUX              IOMUX_REMAP4_TMR4_GMUX_Msk              /*!< TMR4_GMUX[3:0] bits (TMR4 IO general multiplexing) */
#define IOMUX_REMAP4_TMR4_GMUX_0            (0x1U << IOMUX_REMAP4_TMR4_GMUX_Pos)    /*!< 0x00001000 */
#define IOMUX_REMAP4_TMR4_GMUX_1            (0x2U << IOMUX_REMAP4_TMR4_GMUX_Pos)    /*!< 0x00002000 */
#define IOMUX_REMAP4_TMR4_GMUX_2            (0x4U << IOMUX_REMAP4_TMR4_GMUX_Pos)    /*!< 0x00004000 */
#define IOMUX_REMAP4_TMR4_GMUX_3            (0x8U << IOMUX_REMAP4_TMR4_GMUX_Pos)    /*!< 0x00008000 */

#define IOMUX_REMAP4_TMR5CH4_GMUX_Pos       (19U)
#define IOMUX_REMAP4_TMR5CH4_GMUX_Msk       (0x1U << IOMUX_REMAP4_TMR5CH4_GMUX_Pos) /*!< 0x00080000 */
#define IOMUX_REMAP4_TMR5CH4_GMUX           IOMUX_REMAP4_TMR5CH4_GMUX_Msk           /*!< TMR5 channel 4 general multiplexing */

/*****************  Bit definition for IOMUX_REMAP5 register  *****************/
#define IOMUX_REMAP5_USART5_GMUX_Pos        (0U)
#define IOMUX_REMAP5_USART5_GMUX_Msk        (0xFU << IOMUX_REMAP5_USART5_GMUX_Pos)  /*!< 0x0000000F */
#define IOMUX_REMAP5_USART5_GMUX            IOMUX_REMAP5_USART5_GMUX_Msk            /*!< USART5_GMUX[3:0] bits (USART5 IO general multiplexing) */
#define IOMUX_REMAP5_USART5_GMUX_0          (0x1U << IOMUX_REMAP5_USART5_GMUX_Pos)  /*!< 0x00000001 */
#define IOMUX_REMAP5_USART5_GMUX_1          (0x2U << IOMUX_REMAP5_USART5_GMUX_Pos)  /*!< 0x00000002 */
#define IOMUX_REMAP5_USART5_GMUX_2          (0x4U << IOMUX_REMAP5_USART5_GMUX_Pos)  /*!< 0x00000004 */
#define IOMUX_REMAP5_USART5_GMUX_3          (0x8U << IOMUX_REMAP5_USART5_GMUX_Pos)  /*!< 0x00000008 */

