HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
/*******************  Bit definition for SPI_TCRC register  *******************/
#define SPI_TCRC_TCRC_Pos                   (0U)
#define SPI_TCRC_TCRC_Msk                   (0xFFFFU << SPI_TCRC_TCRC_Pos)          /*!< 0x0000FFFF */
#define SPI_TCRC_TCRC                       SPI_TCRC_TCRC_Msk                       /*!< Transmit CRC */

/*****************  Bit definition for SPI_I2SCTRL register  ******************/
#define SPI_I2SCTRL_I2SCBN_Pos              (0U)
#define SPI_I2SCTRL_I2SCBN_Msk              (0x1U << SPI_I2SCTRL_I2SCBN_Pos)        /*!< 0x00000001 */
#define SPI_I2SCTRL_I2SCBN                  SPI_I2SCTRL_I2SCBN_Msk                  /*!< Channel length (I2S channel bit num) */

#define SPI_I2SCTRL_I2SDBN_Pos              (1U)
#define SPI_I2SCTRL_I2SDBN_Msk              (0x3U << SPI_I2SCTRL_I2SDBN_Pos)        /*!< 0x00000006 */
#define SPI_I2SCTRL_I2SDBN                  SPI_I2SCTRL_I2SDBN_Msk                  /*!< I2SDBN[1:0] bits (I2S data bit num) */
#define SPI_I2SCTRL_I2SDBN_0                (0x1U << SPI_I2SCTRL_I2SDBN_Pos)        /*!< 0x00000002 */
#define SPI_I2SCTRL_I2SDBN_1                (0x2U << SPI_I2SCTRL_I2SDBN_Pos)        /*!< 0x00000004 */

#define SPI_I2SCTRL_I2SCLKPOL_Pos           (3U)
#define SPI_I2SCTRL_I2SCLKPOL_Msk           (0x1U << SPI_I2SCTRL_I2SCLKPOL_Pos)     /*!< 0x00000008 */
#define SPI_I2SCTRL_I2SCLKPOL               SPI_I2SCTRL_I2SCLKPOL_Msk               /*!< I2S clock polarity */

#define SPI_I2SCTRL_STDSEL_Pos              (4U)
#define SPI_I2SCTRL_STDSEL_Msk              (0x3U << SPI_I2SCTRL_STDSEL_Pos)        /*!< 0x00000030 */
#define SPI_I2SCTRL_STDSEL                  SPI_I2SCTRL_STDSEL_Msk                  /*!< STDSEL[1:0] bits (I2S standard select) */
#define SPI_I2SCTRL_STDSEL_0                (0x1U << SPI_I2SCTRL_STDSEL_Pos)        /*!< 0x00000010 */
#define SPI_I2SCTRL_STDSEL_1                (0x2U << SPI_I2SCTRL_STDSEL_Pos)        /*!< 0x00000020 */

#define SPI_I2SCTRL_PCMFSSEL_Pos            (7U)
#define SPI_I2SCTRL_PCMFSSEL_Msk            (0x1U << SPI_I2SCTRL_PCMFSSEL_Pos)      /*!< 0x00000080 */
#define SPI_I2SCTRL_PCMFSSEL                SPI_I2SCTRL_PCMFSSEL_Msk                /*!< PCM frame synchronization */

#define SPI_I2SCTRL_OPERSEL_Pos             (8U)
#define SPI_I2SCTRL_OPERSEL_Msk             (0x3U << SPI_I2SCTRL_OPERSEL_Pos)       /*!< 0x00000300 */
#define SPI_I2SCTRL_OPERSEL                 SPI_I2SCTRL_OPERSEL_Msk                 /*!< OPERSEL[1:0] bits (I2S operation mode select) */
#define SPI_I2SCTRL_OPERSEL_0               (0x1U << SPI_I2SCTRL_OPERSEL_Pos)       /*!< 0x00000100 */
#define SPI_I2SCTRL_OPERSEL_1               (0x2U << SPI_I2SCTRL_OPERSEL_Pos)       /*!< 0x00000200 */

#define SPI_I2SCTRL_I2SEN_Pos               (10U)
#define SPI_I2SCTRL_I2SEN_Msk               (0x1U << SPI_I2SCTRL_I2SEN_Pos)         /*!< 0x00000400 */
#define SPI_I2SCTRL_I2SEN                   SPI_I2SCTRL_I2SEN_Msk                   /*!< I2S enable */
#define SPI_I2SCTRL_I2SMSEL_Pos             (11U)
#define SPI_I2SCTRL_I2SMSEL_Msk             (0x1U << SPI_I2SCTRL_I2SMSEL_Pos)       /*!< 0x00000800 */
#define SPI_I2SCTRL_I2SMSEL                 SPI_I2SCTRL_I2SMSEL_Msk                 /*!< I2S mode select */

/*****************  Bit definition for SPI_I2SCLKP register  ******************/
#define SPI_I2SCLKP_I2SDIV_Pos              (0U)
#define SPI_I2SCLKP_I2SDIV_Msk              (0xFFU << SPI_I2SCLKP_I2SDIV_Pos)       /*!< 0x000000FF */
#define SPI_I2SCLKP_I2SDIV                  SPI_I2SCLKP_I2SDIV_Msk                  /*!< I2S division */
#define SPI_I2SCLKP_I2SODD_Pos              (8U)
#define SPI_I2SCLKP_I2SODD_Msk              (0x1U << SPI_I2SCLKP_I2SODD_Pos)        /*!< 0x00000100 */
#define SPI_I2SCLKP_I2SODD                  SPI_I2SCLKP_I2SODD_Msk                  /*!< Odd factor for I2S division */
#define SPI_I2SCLKP_I2SMCLKOE_Pos           (9U)
#define SPI_I2SCLKP_I2SMCLKOE_Msk           (0x1U << SPI_I2SCLKP_I2SMCLKOE_Pos)     /*!< 0x00000200 */
#define SPI_I2SCLKP_I2SMCLKOE               SPI_I2SCLKP_I2SMCLKOE_Msk               /*!< I2S Master clock output enable */

/******************************************************************************/
/*                                                                            */
/*                                Timers (TMR)                                */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for TMR_CTRL1 register  *******************/
#define TMR_CTRL1_TMREN_Pos                 (0U)
#define TMR_CTRL1_TMREN_Msk                 (0x1U << TMR_CTRL1_TMREN_Pos)           /*!< 0x00000001 */
#define TMR_CTRL1_TMREN                     TMR_CTRL1_TMREN_Msk                     /*!< TMR enable */
#define TMR_CTRL1_OVFEN_Pos                 (1U)
#define TMR_CTRL1_OVFEN_Msk                 (0x1U << TMR_CTRL1_OVFEN_Pos)           /*!< 0x00000002 */
#define TMR_CTRL1_OVFEN                     TMR_CTRL1_OVFEN_Msk                     /*!< Overflow event enable */
#define TMR_CTRL1_OVFS_Pos                  (2U)
#define TMR_CTRL1_OVFS_Msk                  (0x1U << TMR_CTRL1_OVFS_Pos)            /*!< 0x00000004 */
#define TMR_CTRL1_OVFS                      TMR_CTRL1_OVFS_Msk                      /*!< Overflow event source */
#define TMR_CTRL1_OCMEN_Pos                 (3U)
#define TMR_CTRL1_OCMEN_Msk                 (0x1U << TMR_CTRL1_OCMEN_Pos)           /*!< 0x00000008 */
#define TMR_CTRL1_OCMEN                     TMR_CTRL1_OCMEN_Msk                     /*!< One cycle mode enable */
#define TMR_CTRL1_OWCDIR_Pos                (4U)
#define TMR_CTRL1_OWCDIR_Msk                (0x1U << TMR_CTRL1_OWCDIR_Pos)          /*!< 0x00000010 */
#define TMR_CTRL1_OWCDIR                    TMR_CTRL1_OWCDIR_Msk                    /*!< One-way count direction */

#define TMR_CTRL1_TWCMSEL_Pos               (5U)
#define TMR_CTRL1_TWCMSEL_Msk               (0x3U << TMR_CTRL1_TWCMSEL_Pos)         /*!< 0x00000060 */
#define TMR_CTRL1_TWCMSEL                   TMR_CTRL1_TWCMSEL_Msk                   /*!< TWCMSEL[1:0] bits (Two-way counting mode selection) */
#define TMR_CTRL1_TWCMSEL_0                 (0x1U << TMR_CTRL1_TWCMSEL_Pos)         /*!< 0x00000020 */
#define TMR_CTRL1_TWCMSEL_1                 (0x2U << TMR_CTRL1_TWCMSEL_Pos)         /*!< 0x00000040 */

