HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
#define TMR_CTRL1_PRBEN_Pos                 (7U)
#define TMR_CTRL1_PRBEN_Msk                 (0x1U << TMR_CTRL1_PRBEN_Pos)           /*!< 0x00000080 */
#define TMR_CTRL1_PRBEN                     TMR_CTRL1_PRBEN_Msk                     /*!< Period buffer enable */

#define TMR_CTRL1_CLKDIV_Pos                (8U)
#define TMR_CTRL1_CLKDIV_Msk                (0x3U << TMR_CTRL1_CLKDIV_Pos)          /*!< 0x00000300 */
#define TMR_CTRL1_CLKDIV                    TMR_CTRL1_CLKDIV_Msk                    /*!< CLKDIV[1:0] bits (Clock division) */
#define TMR_CTRL1_CLKDIV_0                  (0x1U << TMR_CTRL1_CLKDIV_Pos)          /*!< 0x00000100 */
#define TMR_CTRL1_CLKDIV_1                  (0x2U << TMR_CTRL1_CLKDIV_Pos)          /*!< 0x00000200 */

/******************  Bit definition for TMR_CTRL2 register  *******************/
#define TMR_CTRL2_CBCTRL_Pos                (0U)
#define TMR_CTRL2_CBCTRL_Msk                (0x1U << TMR_CTRL2_CBCTRL_Pos)          /*!< 0x00000001 */
#define TMR_CTRL2_CBCTRL                    TMR_CTRL2_CBCTRL_Msk                    /*!< Channel buffer control */
#define TMR_CTRL2_CCFS_Pos                  (2U)
#define TMR_CTRL2_CCFS_Msk                  (0x1U << TMR_CTRL2_CCFS_Pos)            /*!< 0x00000004 */
#define TMR_CTRL2_CCFS                      TMR_CTRL2_CCFS_Msk                      /*!< Channel control bit flash selection */
#define TMR_CTRL2_DRS_Pos                   (3U)
#define TMR_CTRL2_DRS_Msk                   (0x1U << TMR_CTRL2_DRS_Pos)             /*!< 0x00000008 */
#define TMR_CTRL2_DRS                       TMR_CTRL2_DRS_Msk                       /*!< DMA request source */

#define TMR_CTRL2_PTOS_Pos                  (4U)
#define TMR_CTRL2_PTOS_Msk                  (0x7U << TMR_CTRL2_PTOS_Pos)            /*!< 0x00000070 */
#define TMR_CTRL2_PTOS                      TMR_CTRL2_PTOS_Msk                      /*!< PTOS[2:0] bits (Master TMR output selection) */
#define TMR_CTRL2_PTOS_0                    (0x1U << TMR_CTRL2_PTOS_Pos)            /*!< 0x00000010 */
#define TMR_CTRL2_PTOS_1                    (0x2U << TMR_CTRL2_PTOS_Pos)            /*!< 0x00000020 */
#define TMR_CTRL2_PTOS_2                    (0x4U << TMR_CTRL2_PTOS_Pos)            /*!< 0x00000040 */

#define TMR_CTRL2_C1INSEL_Pos               (7U)
#define TMR_CTRL2_C1INSEL_Msk               (0x1U << TMR_CTRL2_C1INSEL_Pos)         /*!< 0x00000080 */
#define TMR_CTRL2_C1INSEL                   TMR_CTRL2_C1INSEL_Msk                   /*!< C1IN selection */
#define TMR_CTRL2_C1IOS_Pos                 (8U)
#define TMR_CTRL2_C1IOS_Msk                 (0x1U << TMR_CTRL2_C1IOS_Pos)           /*!< 0x00000100 */
#define TMR_CTRL2_C1IOS                     TMR_CTRL2_C1IOS_Msk                     /*!< Channel 1 idle output state */
#define TMR_CTRL2_C1CIOS_Pos                (9U)
#define TMR_CTRL2_C1CIOS_Msk                (0x1U << TMR_CTRL2_C1CIOS_Pos)          /*!< 0x00000200 */
#define TMR_CTRL2_C1CIOS                    TMR_CTRL2_C1CIOS_Msk                    /*!< Channel 1 complementary idle output state */
#define TMR_CTRL2_C2IOS_Pos                 (10U)
#define TMR_CTRL2_C2IOS_Msk                 (0x1U << TMR_CTRL2_C2IOS_Pos)           /*!< 0x00000400 */
#define TMR_CTRL2_C2IOS                     TMR_CTRL2_C2IOS_Msk                     /*!< Channel 2 idle output state */
#define TMR_CTRL2_C2CIOS_Pos                (11U)
#define TMR_CTRL2_C2CIOS_Msk                (0x1U << TMR_CTRL2_C2CIOS_Pos)          /*!< 0x00000800 */
#define TMR_CTRL2_C2CIOS                    TMR_CTRL2_C2CIOS_Msk                    /*!< Channel 2 complementary idle output state */
#define TMR_CTRL2_C3IOS_Pos                 (12U)
#define TMR_CTRL2_C3IOS_Msk                 (0x1U << TMR_CTRL2_C3IOS_Pos)           /*!< 0x00001000 */
#define TMR_CTRL2_C3IOS                     TMR_CTRL2_C3IOS_Msk                     /*!< Channel 3 idle output state */
#define TMR_CTRL2_C3CIOS_Pos                (13U)
#define TMR_CTRL2_C3CIOS_Msk                (0x1U << TMR_CTRL2_C3CIOS_Pos)          /*!< 0x00002000 */
#define TMR_CTRL2_C3CIOS                    TMR_CTRL2_C3CIOS_Msk                    /*!< Channel 3 complementary idle output state */
#define TMR_CTRL2_C4IOS_Pos                 (14U)
#define TMR_CTRL2_C4IOS_Msk                 (0x1U << TMR_CTRL2_C4IOS_Pos)           /*!< 0x00004000 */
#define TMR_CTRL2_C4IOS                     TMR_CTRL2_C4IOS_Msk                     /*!< Channel 4 idle output state */

/******************  Bit definition for TMR_STCTRL register  ******************/
#define TMR_STCTRL_SMSEL_Pos                (0U)
#define TMR_STCTRL_SMSEL_Msk                (0x7U << TMR_STCTRL_SMSEL_Pos)          /*!< 0x00000007 */
#define TMR_STCTRL_SMSEL                    TMR_STCTRL_SMSEL_Msk                    /*!< SMSEL[2:0] bits (Subordinate TMR mode selection) */
#define TMR_STCTRL_SMSEL_0                  (0x1U << TMR_STCTRL_SMSEL_Pos)          /*!< 0x00000001 */
#define TMR_STCTRL_SMSEL_1                  (0x2U << TMR_STCTRL_SMSEL_Pos)          /*!< 0x00000002 */
#define TMR_STCTRL_SMSEL_2                  (0x4U << TMR_STCTRL_SMSEL_Pos)          /*!< 0x00000004 */

#define TMR_STCTRL_STIS_Pos                 (4U)
#define TMR_STCTRL_STIS_Msk                 (0x7U << TMR_STCTRL_STIS_Pos)           /*!< 0x00000070 */
#define TMR_STCTRL_STIS                     TMR_STCTRL_STIS_Msk                     /*!< STIS[2:0] bits (Subordinate TMR input selection) */
#define TMR_STCTRL_STIS_0                   (0x1U << TMR_STCTRL_STIS_Pos)           /*!< 0x00000010 */
#define TMR_STCTRL_STIS_1                   (0x2U << TMR_STCTRL_STIS_Pos)           /*!< 0x00000020 */
#define TMR_STCTRL_STIS_2                   (0x4U << TMR_STCTRL_STIS_Pos)           /*!< 0x00000040 */

#define TMR_STCTRL_STS_Pos                  (7U)
#define TMR_STCTRL_STS_Msk                  (0x1U << TMR_STCTRL_STS_Pos)            /*!< 0x00000080 */
#define TMR_STCTRL_STS                      TMR_STCTRL_STS_Msk                      /*!< Subordinate TMR synchronization */

#define TMR_STCTRL_ESF_Pos                  (8U)
#define TMR_STCTRL_ESF_Msk                  (0xFU << TMR_STCTRL_ESF_Pos)            /*!< 0x00000F00 */
#define TMR_STCTRL_ESF                      TMR_STCTRL_ESF_Msk                      /*!< ESF[3:0] bits (External signal filter) */
#define TMR_STCTRL_ESF_0                    (0x1U << TMR_STCTRL_ESF_Pos)            /*!< 0x00000100 */
#define TMR_STCTRL_ESF_1                    (0x2U << TMR_STCTRL_ESF_Pos)            /*!< 0x00000200 */
#define TMR_STCTRL_ESF_2                    (0x4U << TMR_STCTRL_ESF_Pos)            /*!< 0x00000400 */
#define TMR_STCTRL_ESF_3                    (0x8U << TMR_STCTRL_ESF_Pos)            /*!< 0x00000800 */

#define TMR_STCTRL_ESDIV_Pos                (12U)
#define TMR_STCTRL_ESDIV_Msk                (0x3U << TMR_STCTRL_ESDIV_Pos)          /*!< 0x00003000 */
#define TMR_STCTRL_ESDIV                    TMR_STCTRL_ESDIV_Msk                    /*!< ESDIV[1:0] bits (External signal divide) */
#define TMR_STCTRL_ESDIV_0                  (0x1U << TMR_STCTRL_ESDIV_Pos)          /*!< 0x00001000 */
#define TMR_STCTRL_ESDIV_1                  (0x2U << TMR_STCTRL_ESDIV_Pos)          /*!< 0x00002000 */

