HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
/******************  Bit definition for TMR_SWEVT register  *******************/
#define TMR_SWEVT_OVFSWTR_Pos               (0U)
#define TMR_SWEVT_OVFSWTR_Msk               (0x1U << TMR_SWEVT_OVFSWTR_Pos)         /*!< 0x00000001 */
#define TMR_SWEVT_OVFSWTR                   TMR_SWEVT_OVFSWTR_Msk                   /*!< Overflow event triggered by software */
#define TMR_SWEVT_C1SWTR_Pos                (1U)
#define TMR_SWEVT_C1SWTR_Msk                (0x1U << TMR_SWEVT_C1SWTR_Pos)          /*!< 0x00000002 */
#define TMR_SWEVT_C1SWTR                    TMR_SWEVT_C1SWTR_Msk                    /*!< Channel 1 event triggered by software */
#define TMR_SWEVT_C2SWTR_Pos                (2U)
#define TMR_SWEVT_C2SWTR_Msk                (0x1U << TMR_SWEVT_C2SWTR_Pos)          /*!< 0x00000004 */
#define TMR_SWEVT_C2SWTR                    TMR_SWEVT_C2SWTR_Msk                    /*!< Channel 2 event triggered by software */
#define TMR_SWEVT_C3SWTR_Pos                (3U)
#define TMR_SWEVT_C3SWTR_Msk                (0x1U << TMR_SWEVT_C3SWTR_Pos)          /*!< 0x00000008 */
#define TMR_SWEVT_C3SWTR                    TMR_SWEVT_C3SWTR_Msk                    /*!< Channel 3 event triggered by software */
#define TMR_SWEVT_C4SWTR_Pos                (4U)
#define TMR_SWEVT_C4SWTR_Msk                (0x1U << TMR_SWEVT_C4SWTR_Pos)          /*!< 0x00000010 */
#define TMR_SWEVT_C4SWTR                    TMR_SWEVT_C4SWTR_Msk                    /*!< Channel 4 event triggered by software */
#define TMR_SWEVT_HALLSWTR_Pos              (5U)
#define TMR_SWEVT_HALLSWTR_Msk              (0x1U << TMR_SWEVT_HALLSWTR_Pos)        /*!< 0x00000020 */
#define TMR_SWEVT_HALLSWTR                  TMR_SWEVT_HALLSWTR_Msk                  /*!< HALL event triggered by software */
#define TMR_SWEVT_TRGSWTR_Pos               (6U)
#define TMR_SWEVT_TRGSWTR_Msk               (0x1U << TMR_SWEVT_TRGSWTR_Pos)         /*!< 0x00000040 */
#define TMR_SWEVT_TRGSWTR                   TMR_SWEVT_TRGSWTR_Msk                   /*!< Trigger event triggered by software */
#define TMR_SWEVT_BRKSWTR_Pos               (7U)
#define TMR_SWEVT_BRKSWTR_Msk               (0x1U << TMR_SWEVT_BRKSWTR_Pos)         /*!< 0x00000080 */
#define TMR_SWEVT_BRKSWTR                   TMR_SWEVT_BRKSWTR_Msk                   /*!< Break event triggered by software */

/*******************  Bit definition for TMR_CM1 register  ********************/
#define TMR_CM1_C1C_Pos                     (0U)
#define TMR_CM1_C1C_Msk                     (0x3U << TMR_CM1_C1C_Pos)               /*!< 0x00000003 */
#define TMR_CM1_C1C                         TMR_CM1_C1C_Msk                         /*!< C1C[1:0] bits (Channel 1 configuration) */
#define TMR_CM1_C1C_0                       (0x1U << TMR_CM1_C1C_Pos)               /*!< 0x00000001 */
#define TMR_CM1_C1C_1                       (0x2U << TMR_CM1_C1C_Pos)               /*!< 0x00000002 */

#define TMR_CM1_C1OIEN_Pos                  (2U)
#define TMR_CM1_C1OIEN_Msk                  (0x1U << TMR_CM1_C1OIEN_Pos)            /*!< 0x00000004 */
#define TMR_CM1_C1OIEN                      TMR_CM1_C1OIEN_Msk                      /*!< Channel 1 output enable immediately */
#define TMR_CM1_C1OBEN_Pos                  (3U)
#define TMR_CM1_C1OBEN_Msk                  (0x1U << TMR_CM1_C1OBEN_Pos)            /*!< 0x00000008 */
#define TMR_CM1_C1OBEN                      TMR_CM1_C1OBEN_Msk                      /*!< Channel 1 output buffer enable */

#define TMR_CM1_C1OCTRL_Pos                 (4U)
#define TMR_CM1_C1OCTRL_Msk                 (0x7U << TMR_CM1_C1OCTRL_Pos)           /*!< 0x00000070 */
#define TMR_CM1_C1OCTRL                     TMR_CM1_C1OCTRL_Msk                     /*!< C1OCTRL[2:0] bits (Channel 1 output control) */
#define TMR_CM1_C1OCTRL_0                   (0x1U << TMR_CM1_C1OCTRL_Pos)           /*!< 0x00000010 */
#define TMR_CM1_C1OCTRL_1                   (0x2U << TMR_CM1_C1OCTRL_Pos)           /*!< 0x00000020 */
#define TMR_CM1_C1OCTRL_2                   (0x4U << TMR_CM1_C1OCTRL_Pos)           /*!< 0x00000040 */

#define TMR_CM1_C1OSEN_Pos                  (7U)
#define TMR_CM1_C1OSEN_Msk                  (0x1U << TMR_CM1_C1OSEN_Pos)            /*!< 0x00000080 */
#define TMR_CM1_C1OSEN                      TMR_CM1_C1OSEN_Msk                      /*!< Channel 1 output switch enable */

#define TMR_CM1_C2C_Pos                     (8U)
#define TMR_CM1_C2C_Msk                     (0x3U << TMR_CM1_C2C_Pos)               /*!< 0x00000300 */
#define TMR_CM1_C2C                         TMR_CM1_C2C_Msk                         /*!< C2C[1:0] bits (Channel 2 configuration) */
#define TMR_CM1_C2C_0                       (0x1U << TMR_CM1_C2C_Pos)               /*!< 0x00000100 */
#define TMR_CM1_C2C_1                       (0x2U << TMR_CM1_C2C_Pos)               /*!< 0x00000200 */

#define TMR_CM1_C2OIEN_Pos                  (10U)
#define TMR_CM1_C2OIEN_Msk                  (0x1U << TMR_CM1_C2OIEN_Pos)            /*!< 0x00000400 */
#define TMR_CM1_C2OIEN                      TMR_CM1_C2OIEN_Msk                      /*!< Channel 2 output enable immediately */
#define TMR_CM1_C2OBEN_Pos                  (11U)
#define TMR_CM1_C2OBEN_Msk                  (0x1U << TMR_CM1_C2OBEN_Pos)            /*!< 0x00000800 */
#define TMR_CM1_C2OBEN                      TMR_CM1_C2OBEN_Msk                      /*!< Channel 2 output buffer enable */

#define TMR_CM1_C2OCTRL_Pos                 (12U)
#define TMR_CM1_C2OCTRL_Msk                 (0x7U << TMR_CM1_C2OCTRL_Pos)           /*!< 0x00007000 */
#define TMR_CM1_C2OCTRL                     TMR_CM1_C2OCTRL_Msk                     /*!< C2OCTRL[2:0] bits (Channel 2 output control) */
#define TMR_CM1_C2OCTRL_0                   (0x1U << TMR_CM1_C2OCTRL_Pos)           /*!< 0x00001000 */
#define TMR_CM1_C2OCTRL_1                   (0x2U << TMR_CM1_C2OCTRL_Pos)           /*!< 0x00002000 */
#define TMR_CM1_C2OCTRL_2                   (0x4U << TMR_CM1_C2OCTRL_Pos)           /*!< 0x00004000 */

#define TMR_CM1_C2OSEN_Pos                  (15U)
#define TMR_CM1_C2OSEN_Msk                  (0x1U << TMR_CM1_C2OSEN_Pos)            /*!< 0x00008000 */
#define TMR_CM1_C2OSEN                      TMR_CM1_C2OSEN_Msk                      /*!< Channel 2 output switch enable */

/*--------------------------------------------------------------------------------*/

#define TMR_CM1_C1IDIV_Pos                  (2U)
#define TMR_CM1_C1IDIV_Msk                  (0x3U << TMR_CM1_C1IDIV_Pos)            /*!< 0x0000000C */
#define TMR_CM1_C1IDIV                      TMR_CM1_C1IDIV_Msk                      /*!< C1IDIV[1:0] bits (Channel 1 input divider) */
#define TMR_CM1_C1IDIV_0                    (0x1U << TMR_CM1_C1IDIV_Pos)            /*!< 0x00000004 */
#define TMR_CM1_C1IDIV_1                    (0x2U << TMR_CM1_C1IDIV_Pos)            /*!< 0x00000008 */

#define TMR_CM1_C1DF_Pos                    (4U)
#define TMR_CM1_C1DF_Msk                    (0xFU << TMR_CM1_C1DF_Pos)              /*!< 0x000000F0 */
#define TMR_CM1_C1DF                        TMR_CM1_C1DF_Msk                        /*!< C1DF[3:0] bits (Channel 1 digital filter) */
#define TMR_CM1_C1DF_0                      (0x1U << TMR_CM1_C1DF_Pos)              /*!< 0x00000010 */
#define TMR_CM1_C1DF_1                      (0x2U << TMR_CM1_C1DF_Pos)              /*!< 0x00000020 */
#define TMR_CM1_C1DF_2                      (0x4U << TMR_CM1_C1DF_Pos)              /*!< 0x00000040 */
#define TMR_CM1_C1DF_3                      (0x8U << TMR_CM1_C1DF_Pos)              /*!< 0x00000080 */

