HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
#define DAC_CTRL_D1NM_Pos                   (6U)
#define DAC_CTRL_D1NM_Msk                   (0x3U << DAC_CTRL_D1NM_Pos)             /*!< 0x000000C0 */
#define DAC_CTRL_D1NM                       DAC_CTRL_D1NM_Msk                       /*!< D1NM[1:0] (DAC1 noise mode) */
#define DAC_CTRL_D1NM_0                     (0x1U << DAC_CTRL_D1NM_Pos)             /*!< 0x00000040 */
#define DAC_CTRL_D1NM_1                     (0x2U << DAC_CTRL_D1NM_Pos)             /*!< 0x00000080 */

#define DAC_CTRL_D1NBSEL_Pos                (8U)
#define DAC_CTRL_D1NBSEL_Msk                (0xFU << DAC_CTRL_D1NBSEL_Pos)          /*!< 0x00000F00 */
#define DAC_CTRL_D1NBSEL                    DAC_CTRL_D1NBSEL_Msk                    /*!< D1NBSEL[3:0] (DAC1 noise bit select) */
#define DAC_CTRL_D1NBSEL_0                  (0x1U << DAC_CTRL_D1NBSEL_Pos)          /*!< 0x00000100 */
#define DAC_CTRL_D1NBSEL_1                  (0x2U << DAC_CTRL_D1NBSEL_Pos)          /*!< 0x00000200 */
#define DAC_CTRL_D1NBSEL_2                  (0x4U << DAC_CTRL_D1NBSEL_Pos)          /*!< 0x00000400 */
#define DAC_CTRL_D1NBSEL_3                  (0x8U << DAC_CTRL_D1NBSEL_Pos)          /*!< 0x00000800 */

#define DAC_CTRL_D1DMAEN_Pos                (12U)
#define DAC_CTRL_D1DMAEN_Msk                (0x1U << DAC_CTRL_D1DMAEN_Pos)          /*!< 0x00001000 */
#define DAC_CTRL_D1DMAEN                    DAC_CTRL_D1DMAEN_Msk                    /*!< DAC1 DMA transfer enable */
#define DAC_CTRL_D2EN_Pos                   (16U)
#define DAC_CTRL_D2EN_Msk                   (0x1U << DAC_CTRL_D2EN_Pos)             /*!< 0x00010000 */
#define DAC_CTRL_D2EN                       DAC_CTRL_D2EN_Msk                       /*!< DAC2 enable */
#define DAC_CTRL_D2OBDIS_Pos                (17U)
#define DAC_CTRL_D2OBDIS_Msk                (0x1U << DAC_CTRL_D2OBDIS_Pos)          /*!< 0x00020000 */
#define DAC_CTRL_D2OBDIS                    DAC_CTRL_D2OBDIS_Msk                    /*!< DAC2 output buffer disable */
#define DAC_CTRL_D2TRGEN_Pos                (18U)
#define DAC_CTRL_D2TRGEN_Msk                (0x1U << DAC_CTRL_D2TRGEN_Pos)          /*!< 0x00040000 */
#define DAC_CTRL_D2TRGEN                    DAC_CTRL_D2TRGEN_Msk                    /*!< DAC2 trigger enable */

#define DAC_CTRL_D2TRGSEL_Pos               (19U)
#define DAC_CTRL_D2TRGSEL_Msk               (0x7U << DAC_CTRL_D2TRGSEL_Pos)         /*!< 0x00380000 */
#define DAC_CTRL_D2TRGSEL                   DAC_CTRL_D2TRGSEL_Msk                   /*!< D2TRGSEL[2:0] (DAC2 trigger select) */
#define DAC_CTRL_D2TRGSEL_0                 (0x1U << DAC_CTRL_D2TRGSEL_Pos)         /*!< 0x00080000 */
#define DAC_CTRL_D2TRGSEL_1                 (0x2U << DAC_CTRL_D2TRGSEL_Pos)         /*!< 0x00100000 */
#define DAC_CTRL_D2TRGSEL_2                 (0x4U << DAC_CTRL_D2TRGSEL_Pos)         /*!< 0x00200000 */

#define DAC_CTRL_D2NM_Pos                   (22U)
#define DAC_CTRL_D2NM_Msk                   (0x3U << DAC_CTRL_D2NM_Pos)             /*!< 0x00C00000 */
#define DAC_CTRL_D2NM                       DAC_CTRL_D2NM_Msk                       /*!< D2NM[1:0] (DAC2 noise mode) */
#define DAC_CTRL_D2NM_0                     (0x1U << DAC_CTRL_D2NM_Pos)             /*!< 0x00400000 */
#define DAC_CTRL_D2NM_1                     (0x2U << DAC_CTRL_D2NM_Pos)             /*!< 0x00800000 */

#define DAC_CTRL_D2NBSEL_Pos                (24U)
#define DAC_CTRL_D2NBSEL_Msk                (0xFU << DAC_CTRL_D2NBSEL_Pos)          /*!< 0x0F000000 */
#define DAC_CTRL_D2NBSEL                    DAC_CTRL_D2NBSEL_Msk                    /*!< D2NBSEL[3:0] (DAC2 noise bit select) */
#define DAC_CTRL_D2NBSEL_0                  (0x1U << DAC_CTRL_D2NBSEL_Pos)          /*!< 0x01000000 */
#define DAC_CTRL_D2NBSEL_1                  (0x2U << DAC_CTRL_D2NBSEL_Pos)          /*!< 0x02000000 */
#define DAC_CTRL_D2NBSEL_2                  (0x4U << DAC_CTRL_D2NBSEL_Pos)          /*!< 0x04000000 */
#define DAC_CTRL_D2NBSEL_3                  (0x8U << DAC_CTRL_D2NBSEL_Pos)          /*!< 0x08000000 */

#define DAC_CTRL_D2DMAEN_Pos                (28U)
#define DAC_CTRL_D2DMAEN_Msk                (0x1U << DAC_CTRL_D2DMAEN_Pos)          /*!< 0x10000000 */
#define DAC_CTRL_D2DMAEN                    DAC_CTRL_D2DMAEN_Msk                    /*!< DAC2 DMA transfer enable */

/******************  Bit definition for DAC_SWTRG register  *******************/
#define DAC_SWTRG_D1SWTRG_Pos               (0U)
#define DAC_SWTRG_D1SWTRG_Msk               (0x1U << DAC_SWTRG_D1SWTRG_Pos)         /*!< 0x00000001 */
#define DAC_SWTRG_D1SWTRG                   DAC_SWTRG_D1SWTRG_Msk                   /*!< DAC1 software trigger */
#define DAC_SWTRG_D2SWTRG_Pos               (1U)
#define DAC_SWTRG_D2SWTRG_Msk               (0x1U << DAC_SWTRG_D2SWTRG_Pos)         /*!< 0x00000002 */
#define DAC_SWTRG_D2SWTRG                   DAC_SWTRG_D2SWTRG_Msk                   /*!< DAC2 software trigger */

/*****************  Bit definition for DAC_D1DTH12R register  *****************/
#define DAC_D1DTH12R_D1DT12R_Pos            (0U)
#define DAC_D1DTH12R_D1DT12R_Msk            (0xFFFU << DAC_D1DTH12R_D1DT12R_Pos)    /*!< 0x00000FFF */
#define DAC_D1DTH12R_D1DT12R                DAC_D1DTH12R_D1DT12R_Msk                /*!< DAC1 12-bit right-aligned data */

/*****************  Bit definition for DAC_D1DTH12L register  *****************/
#define DAC_D1DTH12L_D1DT12L_Pos            (4U)
#define DAC_D1DTH12L_D1DT12L_Msk            (0xFFFU << DAC_D1DTH12L_D1DT12L_Pos)    /*!< 0x0000FFF0 */
#define DAC_D1DTH12L_D1DT12L                DAC_D1DTH12L_D1DT12L_Msk                /*!< DAC1 12-bit left-aligned data */

/*****************  Bit definition for DAC_D1DTH8R register  ******************/
#define DAC_D1DTH8R_D1DT8R_Pos              (0U)
#define DAC_D1DTH8R_D1DT8R_Msk              (0xFFU << DAC_D1DTH8R_D1DT8R_Pos)       /*!< 0x000000FF */
#define DAC_D1DTH8R_D1DT8R                  DAC_D1DTH8R_D1DT8R_Msk                  /*!< DAC1 8-bit right-aligned data */

/*****************  Bit definition for DAC_D2DTH12R register  *****************/
#define DAC_D2DTH12R_D2DT12R_Pos            (0U)
#define DAC_D2DTH12R_D2DT12R_Msk            (0xFFFU << DAC_D2DTH12R_D2DT12R_Pos)    /*!< 0x00000FFF */
#define DAC_D2DTH12R_D2DT12R                DAC_D2DTH12R_D2DT12R_Msk                /*!< DAC2 12-bit right-aligned data */

/*****************  Bit definition for DAC_D2DTH12L register  *****************/
#define DAC_D2DTH12L_D2DT12L_Pos            (4U)
#define DAC_D2DTH12L_D2DT12L_Msk            (0xFFFU << DAC_D2DTH12L_D2DT12L_Pos)    /*!< 0x0000FFF0 */
#define DAC_D2DTH12L_D2DT12L                DAC_D2DTH12L_D2DT12L_Msk                /*!< DAC2 12-bit left-aligned data */

/*****************  Bit definition for DAC_D2DTH8R register  ******************/
#define DAC_D2DTH8R_D2DT8R_Pos              (0U)
#define DAC_D2DTH8R_D2DT8R_Msk              (0xFFU << DAC_D2DTH8R_D2DT8R_Pos)       /*!< 0x000000FF */
#define DAC_D2DTH8R_D2DT8R                  DAC_D2DTH8R_D2DT8R_Msk                  /*!< DAC2 8-bit right-aligned data */

/*****************  Bit definition for DAC_DDTH12R register  ******************/
#define DAC_DDTH12R_DD1DT12R_Pos            (0U)
#define DAC_DDTH12R_DD1DT12R_Msk            (0xFFFU << DAC_DDTH12R_DD1DT12R_Pos)    /*!< 0x00000FFF */
#define DAC_DDTH12R_DD1DT12R                DAC_DDTH12R_DD1DT12R_Msk                /*!< DAC1 12-bit right-aligned data */
#define DAC_DDTH12R_DD2DT12R_Pos            (16U)
#define DAC_DDTH12R_DD2DT12R_Msk            (0xFFFU << DAC_DDTH12R_DD2DT12R_Pos)    /*!< 0x0FFF0000 */
#define DAC_DDTH12R_DD2DT12R                DAC_DDTH12R_DD2DT12R_Msk                /*!< DAC2 12-bit right-aligned data */

