HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
#define XMC_BK1TMGx_DTLAT_Pos               (24U)
#define XMC_BK1TMGx_DTLAT_Msk               (0xFU << XMC_BK1TMGx_DTLAT_Pos)         /*!< 0x0F000000 */
#define XMC_BK1TMGx_DTLAT                   XMC_BK1TMGx_DTLAT_Msk                   /*!< DTLAT[3:0] bits (Data latency) */
#define XMC_BK1TMGx_DTLAT_0                 (0x1U << XMC_BK1TMGx_DTLAT_Pos)         /*!< 0x01000000 */
#define XMC_BK1TMGx_DTLAT_1                 (0x2U << XMC_BK1TMGx_DTLAT_Pos)         /*!< 0x02000000 */
#define XMC_BK1TMGx_DTLAT_2                 (0x4U << XMC_BK1TMGx_DTLAT_Pos)         /*!< 0x04000000 */
#define XMC_BK1TMGx_DTLAT_3                 (0x8U << XMC_BK1TMGx_DTLAT_Pos)         /*!< 0x08000000 */

#define XMC_BK1TMGx_ASYNCM_Pos              (28U)
#define XMC_BK1TMGx_ASYNCM_Msk              (0x3U << XMC_BK1TMGx_ASYNCM_Pos)        /*!< 0x30000000 */
#define XMC_BK1TMGx_ASYNCM                  XMC_BK1TMGx_ASYNCM_Msk                  /*!< ASYNCM[1:0] bits (Asynchronous mode) */
#define XMC_BK1TMGx_ASYNCM_0                (0x1U << XMC_BK1TMGx_ASYNCM_Pos)        /*!< 0x10000000 */
#define XMC_BK1TMGx_ASYNCM_1                (0x2U << XMC_BK1TMGx_ASYNCM_Pos)        /*!< 0x20000000 */

/**********  Bit definition for XMC_BK1TMGWRx (x = 1 or 4) register  **********/
#define XMC_BK1TMGWRx_ADDRST_Pos            (0U)
#define XMC_BK1TMGWRx_ADDRST_Msk            (0xFU << XMC_BK1TMGWRx_ADDRST_Pos)      /*!< 0x0000000F */
#define XMC_BK1TMGWRx_ADDRST                XMC_BK1TMGWRx_ADDRST_Msk                /*!< ADDRST[3:0] bits (Address setup time) */
#define XMC_BK1TMGWRx_ADDRST_0              (0x1U << XMC_BK1TMGWRx_ADDRST_Pos)      /*!< 0x00000001 */
#define XMC_BK1TMGWRx_ADDRST_1              (0x2U << XMC_BK1TMGWRx_ADDRST_Pos)      /*!< 0x00000002 */
#define XMC_BK1TMGWRx_ADDRST_2              (0x4U << XMC_BK1TMGWRx_ADDRST_Pos)      /*!< 0x00000004 */
#define XMC_BK1TMGWRx_ADDRST_3              (0x8U << XMC_BK1TMGWRx_ADDRST_Pos)      /*!< 0x00000008 */

#define XMC_BK1TMGWRx_ADDRHT_Pos            (4U)
#define XMC_BK1TMGWRx_ADDRHT_Msk            (0xFU << XMC_BK1TMGWRx_ADDRHT_Pos)      /*!< 0x000000F0 */
#define XMC_BK1TMGWRx_ADDRHT                XMC_BK1TMGWRx_ADDRHT_Msk                /*!< ADDRHT[3:0] bits (Address-hold time) */
#define XMC_BK1TMGWRx_ADDRHT_0              (0x1U << XMC_BK1TMGWRx_ADDRHT_Pos)      /*!< 0x00000010 */
#define XMC_BK1TMGWRx_ADDRHT_1              (0x2U << XMC_BK1TMGWRx_ADDRHT_Pos)      /*!< 0x00000020 */
#define XMC_BK1TMGWRx_ADDRHT_2              (0x4U << XMC_BK1TMGWRx_ADDRHT_Pos)      /*!< 0x00000040 */
#define XMC_BK1TMGWRx_ADDRHT_3              (0x8U << XMC_BK1TMGWRx_ADDRHT_Pos)      /*!< 0x00000080 */

#define XMC_BK1TMGWRx_DTST_Pos              (8U)
#define XMC_BK1TMGWRx_DTST_Msk              (0xFFU << XMC_BK1TMGWRx_DTST_Pos)       /*!< 0x0000FF00 */
#define XMC_BK1TMGWRx_DTST                  XMC_BK1TMGWRx_DTST_Msk                  /*!< DTST[7:0] bits (Data setup time) */
#define XMC_BK1TMGWRx_DTST_0                (0x01U << XMC_BK1TMGWRx_DTST_Pos)       /*!< 0x00000100 */
#define XMC_BK1TMGWRx_DTST_1                (0x02U << XMC_BK1TMGWRx_DTST_Pos)       /*!< 0x00000200 */
#define XMC_BK1TMGWRx_DTST_2                (0x04U << XMC_BK1TMGWRx_DTST_Pos)       /*!< 0x00000400 */
#define XMC_BK1TMGWRx_DTST_3                (0x08U << XMC_BK1TMGWRx_DTST_Pos)       /*!< 0x00000800 */
#define XMC_BK1TMGWRx_DTST_4                (0x10U << XMC_BK1TMGWRx_DTST_Pos)       /*!< 0x00001000 */
#define XMC_BK1TMGWRx_DTST_5                (0x20U << XMC_BK1TMGWRx_DTST_Pos)       /*!< 0x00002000 */
#define XMC_BK1TMGWRx_DTST_6                (0x40U << XMC_BK1TMGWRx_DTST_Pos)       /*!< 0x00004000 */
#define XMC_BK1TMGWRx_DTST_7                (0x80U << XMC_BK1TMGWRx_DTST_Pos)       /*!< 0x00008000 */

#define XMC_BK1TMGWRx_BUSLAT_Pos            (16U)
#define XMC_BK1TMGWRx_BUSLAT_Msk            (0xFU << XMC_BK1TMGWRx_BUSLAT_Pos)      /*!< 0x000F0000 */
#define XMC_BK1TMGWRx_BUSLAT                XMC_BK1TMGWRx_BUSLAT_Msk                /*!< BUSLAT[3:0] bits (Bus latency) */
#define XMC_BK1TMGWRx_BUSLAT_0              (0x1U << XMC_BK1TMGWRx_BUSLAT_Pos)      /*!< 0x00010000 */
#define XMC_BK1TMGWRx_BUSLAT_1              (0x2U << XMC_BK1TMGWRx_BUSLAT_Pos)      /*!< 0x00020000 */
#define XMC_BK1TMGWRx_BUSLAT_2              (0x4U << XMC_BK1TMGWRx_BUSLAT_Pos)      /*!< 0x00040000 */
#define XMC_BK1TMGWRx_BUSLAT_3              (0x8U << XMC_BK1TMGWRx_BUSLAT_Pos)      /*!< 0x00080000 */

#define XMC_BK1TMGWRx_ASYNCM_Pos            (28U)
#define XMC_BK1TMGWRx_ASYNCM_Msk            (0x3U << XMC_BK1TMGWRx_ASYNCM_Pos)      /*!< 0x30000000 */
#define XMC_BK1TMGWRx_ASYNCM                XMC_BK1TMGWRx_ASYNCM_Msk                /*!< ASYNCM[1:0] bits (Asynchronous mode) */
#define XMC_BK1TMGWRx_ASYNCM_0              (0x1U << XMC_BK1TMGWRx_ASYNCM_Pos)      /*!< 0x10000000 */
#define XMC_BK1TMGWRx_ASYNCM_1              (0x2U << XMC_BK1TMGWRx_ASYNCM_Pos)      /*!< 0x20000000 */

/************  Bit definition for XMC_EXTx (x = 1 or 4) register  *************/
#define XMC_EXTx_BUSLATW2W_Pos              (0U)
#define XMC_EXTx_BUSLATW2W_Msk              (0xFFU << XMC_EXTx_BUSLATW2W_Pos)       /*!< 0x000000FF */
#define XMC_EXTx_BUSLATW2W                  XMC_EXTx_BUSLATW2W_Msk                  /*!< BUSLATW2W[7:0] bits (Bus turnaround phase for consecutive write duration) */
#define XMC_EXTx_BUSLATW2W_0                (0x01U << XMC_EXTx_BUSLATW2W_Pos)       /*!< 0x00000001 */
#define XMC_EXTx_BUSLATW2W_1                (0x02U << XMC_EXTx_BUSLATW2W_Pos)       /*!< 0x00000002 */
#define XMC_EXTx_BUSLATW2W_2                (0x04U << XMC_EXTx_BUSLATW2W_Pos)       /*!< 0x00000004 */
#define XMC_EXTx_BUSLATW2W_3                (0x08U << XMC_EXTx_BUSLATW2W_Pos)       /*!< 0x00000008 */
#define XMC_EXTx_BUSLATW2W_4                (0x10U << XMC_EXTx_BUSLATW2W_Pos)       /*!< 0x00000010 */
#define XMC_EXTx_BUSLATW2W_5                (0x20U << XMC_EXTx_BUSLATW2W_Pos)       /*!< 0x00000020 */
#define XMC_EXTx_BUSLATW2W_6                (0x40U << XMC_EXTx_BUSLATW2W_Pos)       /*!< 0x00000040 */
#define XMC_EXTx_BUSLATW2W_7                (0x80U << XMC_EXTx_BUSLATW2W_Pos)       /*!< 0x00000080 */

#define XMC_EXTx_BUSLATR2R_Pos              (8U)
#define XMC_EXTx_BUSLATR2R_Msk              (0xFFU << XMC_EXTx_BUSLATR2R_Pos)       /*!< 0x0000FF00 */
#define XMC_EXTx_BUSLATR2R                  XMC_EXTx_BUSLATR2R_Msk                  /*!< BUSLATR2R[7:0] bits (Bus turnaround phase for consecutive read duration) */
#define XMC_EXTx_BUSLATR2R_0                (0x01U << XMC_EXTx_BUSLATR2R_Pos)       /*!< 0x00000100 */
#define XMC_EXTx_BUSLATR2R_1                (0x02U << XMC_EXTx_BUSLATR2R_Pos)       /*!< 0x00000200 */
#define XMC_EXTx_BUSLATR2R_2                (0x04U << XMC_EXTx_BUSLATR2R_Pos)       /*!< 0x00000400 */
#define XMC_EXTx_BUSLATR2R_3                (0x08U << XMC_EXTx_BUSLATR2R_Pos)       /*!< 0x00000800 */
#define XMC_EXTx_BUSLATR2R_4                (0x10U << XMC_EXTx_BUSLATR2R_Pos)       /*!< 0x00001000 */
#define XMC_EXTx_BUSLATR2R_5                (0x20U << XMC_EXTx_BUSLATR2R_Pos)       /*!< 0x00002000 */
#define XMC_EXTx_BUSLATR2R_6                (0x40U << XMC_EXTx_BUSLATR2R_Pos)       /*!< 0x00004000 */
#define XMC_EXTx_BUSLATR2R_7                (0x80U << XMC_EXTx_BUSLATR2R_Pos)       /*!< 0x00008000 */

