HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
/******************  Bit definition for EMAC_MMCTI register  ******************/
#define EMAC_MMCTI_TGF_Pos                  (21U)
#define EMAC_MMCTI_TGF_Msk                  (0x1U << EMAC_MMCTI_TGF_Pos)            /*!< 0x00200000 */
#define EMAC_MMCTI_TGF                      EMAC_MMCTI_TGF_Msk                      /*!< Transmitted Good Frames */
#define EMAC_MMCTI_TGFMSC_Pos               (15U)
#define EMAC_MMCTI_TGFMSC_Msk               (0x1U << EMAC_MMCTI_TGFMSC_Pos)         /*!< 0x00008000 */
#define EMAC_MMCTI_TGFMSC                   EMAC_MMCTI_TGFMSC_Msk                   /*!< Transmitted Good Frames More Single Collision */
#define EMAC_MMCTI_TSCGFCI_Pos              (14U)
#define EMAC_MMCTI_TSCGFCI_Msk              (0x1U << EMAC_MMCTI_TGFSCS_Pos)         /*!< 0x00004000 */
#define EMAC_MMCTI_TSCGFCI                  EMAC_MMCTI_TGFSCS_Msk                   /*!< Transmitted Single Collision Good Frame Counter Interrupt */

/*****************  Bit definition for EMAC_MMCRIM register  ******************/
#define EMAC_MMCRIM_RUGFCIM_Pos             (17U)
#define EMAC_MMCRIM_RUGFCIM_Msk             (0x1U << EMAC_MMCRIM_RUGFCIM_Pos)       /*!< 0x00020000 */
#define EMAC_MMCRIM_RUGFCIM                 EMAC_MMCRIM_RUGFCIM_Msk                 /*!< Received Unicast Good Frame Counter Interrupt Mask */
#define EMAC_MMCRIM_RAEFACIM_Pos            (6U)
#define EMAC_MMCRIM_RAEFACIM_Msk            (0x1U << EMAC_MMCRIM_RAEFACIM_Pos)      /*!< 0x00000040 */
#define EMAC_MMCRIM_RAEFACIM                EMAC_MMCRIM_RAEFACIM_Msk                /*!< Received Alignment Error Frame Alignment Counter Interrupt Mask */
#define EMAC_MMCRIM_RCEFCIM_Pos             (5U)
#define EMAC_MMCRIM_RCEFCIM_Msk             (0x1U << EMAC_MMCRIM_RCEFCIM_Pos)       /*!< 0x00000020 */
#define EMAC_MMCRIM_RCEFCIM                 EMAC_MMCRIM_RCEFCIM_Msk                 /*!< Received CRC Error Frame Counter Interrupt Mask */

/*****************  Bit definition for EMAC_MMCTIM register  ******************/
#define EMAC_MMCTIM_TGFCIM_Pos              (21U)
#define EMAC_MMCTIM_TGFCIM_Msk              (0x1U << EMAC_MMCTIM_TGFCIM_Pos)        /*!< 0x00200000 */
#define EMAC_MMCTIM_TGFCIM                  EMAC_MMCTIM_TGFCIM_Msk                  /*!< Transmitted Good Frame Counter Interrupt Mask */
#define EMAC_MMCTIM_TMCGFCIM_Pos            (15U)
#define EMAC_MMCTIM_TMCGFCIM_Msk            (0x1U << EMAC_MMCTIM_TMCGFCIM_Pos)      /*!< 0x00008000 */
#define EMAC_MMCTIM_TMCGFCIM                EMAC_MMCTIM_TMCGFCIM_Msk                /*!< Transmitted Multiple Collision Good Frame Counter Interrupt Mask */
#define EMAC_MMCTIM_TSCGFCIM_Pos            (14U)
#define EMAC_MMCTIM_TSCGFCIM_Msk            (0x1U << EMAC_MMCTIM_TSCGFCIM_Pos)      /*!< 0x00004000 */
#define EMAC_MMCTIM_TSCGFCIM                EMAC_MMCTIM_TSCGFCIM_Msk                /*!< Transmitted Single Collision Good Frame Counter Interrupt Mask */

/****************  Bit definition for EMAC_MMCTFSCC register  *****************/
#define EMAC_MMCTFSCC_TGFSCC_Pos            (0U)                                    /*!< 0xFFFFFFFF */
#define EMAC_MMCTFSCC_TGFSCC_Msk            (0xFFFFFFFFU << EMAC_MMCTFSCC_TGFSCC_Pos)
#define EMAC_MMCTFSCC_TGFSCC                EMAC_MMCTFSCC_TGFSCC_Msk                /*!< Transmitted Good Frames Single Collision Counter */

/****************  Bit definition for EMAC_MMCTFMSCC register  ****************/
#define EMAC_MMCTFMSCC_TGFMSCC_Pos          (0U)                                    /*!< 0xFFFFFFFF */
#define EMAC_MMCTFMSCC_TGFMSCC_Msk          (0xFFFFFFFFU << EMAC_MMCTFMSCC_TGFMSCC_Pos)
#define EMAC_MMCTFMSCC_TGFMSCC              EMAC_MMCTFMSCC_TGFMSCC_Msk              /*!< Transmitted Good Frame More Than a Single Collision Counter */

/****************  Bit definition for EMAC_MMCTFCNT register  *****************/
#define EMAC_MMCTFCNT_TGFC_Pos              (0U)
#define EMAC_MMCTFCNT_TGFC_Msk              (0xFFFFFFFFU << EMAC_MMCTFCNT_TGFC_Pos) /*!< 0xFFFFFFFF */
#define EMAC_MMCTFCNT_TGFC                  EMAC_MMCTFCNT_TGFC_Msk                  /*!< Transmitted Good Frames Counter */

/***************  Bit definition for EMAC_MMCRFCECNT register  ****************/
#define EMAC_MMCRFCECNT_RFCEC_Pos           (0U)                                    /*!< 0xFFFFFFFF */
#define EMAC_MMCRFCECNT_RFCEC_Msk           (0xFFFFFFFFU << EMAC_MMCRFCECNT_RFCEC_Pos)
#define EMAC_MMCRFCECNT_RFCEC               EMAC_MMCRFCECNT_RFCEC_Msk               /*!< Received Frames CRC Error Counter */

/***************  Bit definition for EMAC_MMCRFAECNT register  ****************/
#define EMAC_MMCRFAECNT_RFAEC_Pos           (0U)                                    /*!< 0xFFFFFFFF */
#define EMAC_MMCRFAECNT_RFAEC_Msk           (0xFFFFFFFFU << EMAC_MMCRFAECNT_RFAEC_Pos)
#define EMAC_MMCRFAECNT_RFAEC               EMAC_MMCRFAECNT_RFAEC_Msk               /*!< Received Frames Alignment Error Counter */

/***************  Bit definition for EMAC_MMCRGUFCNT register  ****************/
#define EMAC_MMCRGUFCNT_RGUFC_Pos           (0U)                                    /*!< 0xFFFFFFFF */
#define EMAC_MMCRGUFCNT_RGUFC_Msk           (0xFFFFFFFFU << EMAC_MMCRGUFCNT_RGUFC_Pos)
#define EMAC_MMCRGUFCNT_RGUFC               EMAC_MMCRGUFCNT_RGUFC_Msk               /*!< Received Good Unicast Frames Counter */

/****************  Bit definition for EMAC_PTPTSCTRL register  ****************/
#define EMAC_PTPTSCTRL_EMAFPFF_Pos          (18U)
#define EMAC_PTPTSCTRL_EMAFPFF_Msk          (0x1U << EMAC_PTPTSCTRL_EMAFPFF_Pos)    /*!< 0x00040000 */
#define EMAC_PTPTSCTRL_EMAFPFF              EMAC_PTPTSCTRL_EMAFPFF_Msk              /*!< Enable MAC Address For PTP Frame Filtering */

/*!< SPPFTS configuration */
#define EMAC_PTPTSCTRL_SPPFTS_Pos           (16U)
#define EMAC_PTPTSCTRL_SPPFTS_Msk           (0x3U << EMAC_PTPTSCTRL_TSITE_Pos)      /*!< 0x00030000 */
#define EMAC_PTPTSCTRL_SPPFTS               EMAC_PTPTSCTRL_TSITE_Msk                /*!< Select PTP Packets For Taking Snapshot */

#define EMAC_PTPTSCTRL_SPPFTS_Normal        0x00000000U                             /*!< Normal clock */
#define EMAC_PTPTSCTRL_SPPFTS_Boundary      0x00010000U                             /*!< Boundary clock */
#define EMAC_PTPTSCTRL_SPPFTS_EndToEnd      0x00020000U                             /*!< End-to-End Transparent Clock */
#define EMAC_PTPTSCTRL_SPPFTS_PointToPoint  0x00030000U                             /*!< Point-to-Point Transparent Clock */

#define EMAC_PTPTSCTRL_ESFMRTM_Pos          (15U)
#define EMAC_PTPTSCTRL_ESFMRTM_Msk          (0x1U << EMAC_PTPTSCTRL_ESFMRTM_Pos)    /*!< 0x00008000 */
#define EMAC_PTPTSCTRL_ESFMRTM              EMAC_PTPTSCTRL_ESFMRTM_Msk              /*!< Enable Snapshot For Message Relevant To Master */
#define EMAC_PTPTSCTRL_ETSFEM_Pos           (14U)
#define EMAC_PTPTSCTRL_ETSFEM_Msk           (0x1U << EMAC_PTPTSCTRL_ETSFEM_Pos)     /*!< 0x00004000 */
#define EMAC_PTPTSCTRL_ETSFEM               EMAC_PTPTSCTRL_ETSFEM_Msk               /*!< Enable Timestamp Snapshot For Event Messages */
#define EMAC_PTPTSCTRL_EPPFSIP4U_Pos        (13U)
#define EMAC_PTPTSCTRL_EPPFSIP4U_Msk        (0x1U << EMAC_PTPTSCTRL_EPPFSIP4U_Pos)  /*!< 0x00002000 */
#define EMAC_PTPTSCTRL_EPPFSIP4U            EMAC_PTPTSCTRL_EPPFSIP4U_Msk            /*!< Enable Processing of PTP Frames Sent over IPv4-UDP */
#define EMAC_PTPTSCTRL_EPPFSIP6U_Pos        (12U)
#define EMAC_PTPTSCTRL_EPPFSIP6U_Msk        (0x1U << EMAC_PTPTSCTRL_EPPFSIP6U_Pos)  /*!< 0x00001000 */
#define EMAC_PTPTSCTRL_EPPFSIP6U            EMAC_PTPTSCTRL_EPPFSIP6U_Msk            /*!< Enable Processing of PTP Frames Sent over IPv6-UDP */
#define EMAC_PTPTSCTRL_EPPEF_Pos            (11U)
#define EMAC_PTPTSCTRL_EPPEF_Msk            (0x1U << EMAC_PTPTSCTRL_EPPEF_Pos)      /*!< 0x00000800 */
#define EMAC_PTPTSCTRL_EPPEF                EMAC_PTPTSCTRL_EPPEF_Msk                /*!< Enable Processing of PTP over EMAC Frames */
#define EMAC_PTPTSCTRL_EPPV2F_Pos           (10U)
#define EMAC_PTPTSCTRL_EPPV2F_Msk           (0x1U << EMAC_PTPTSCTRL_EPPV2F_Pos)     /*!< 0x00000400 */
#define EMAC_PTPTSCTRL_EPPV2F               EMAC_PTPTSCTRL_EPPV2F_Msk               /*!< Enable PTP packet Processing for Version 2 Format */
#define EMAC_PTPTSCTRL_TDBRC_Pos            (9U)
#define EMAC_PTPTSCTRL_TDBRC_Msk            (0x1U << EMAC_PTPTSCTRL_TDBRC_Pos)      /*!< 0x00000200 */
#define EMAC_PTPTSCTRL_TDBRC                EMAC_PTPTSCTRL_TDBRC_Msk                /*!< Timestamp Digital or Binary Rollover Control */
#define EMAC_PTPTSCTRL_ETAF_Pos             (8U)
#define EMAC_PTPTSCTRL_ETAF_Msk             (0x1U << EMAC_PTPTSCTRL_ETAF_Pos)       /*!< 0x00000100 */
#define EMAC_PTPTSCTRL_ETAF                 EMAC_PTPTSCTRL_ETAF_Msk                 /*!< Enable Timestamp for All Frames */
#define EMAC_PTPTSCTRL_ARU_Pos              (5U)
#define EMAC_PTPTSCTRL_ARU_Msk              (0x1U << EMAC_PTPTSCTRL_ARU_Pos)        /*!< 0x00000020 */
#define EMAC_PTPTSCTRL_ARU                  EMAC_PTPTSCTRL_ARU_Msk                  /*!< Addend Register Update */
#define EMAC_PTPTSCTRL_TITE_Pos             (4U)
#define EMAC_PTPTSCTRL_TITE_Msk             (0x1U << EMAC_PTPTSCTRL_TITE_Pos)       /*!< 0x00000010 */
#define EMAC_PTPTSCTRL_TITE                 EMAC_PTPTSCTRL_TITE_Msk                 /*!< Timestamp Interrupt Trigger Enable */
#define EMAC_PTPTSCTRL_TU_Pos               (3U)
#define EMAC_PTPTSCTRL_TU_Msk               (0x1U << EMAC_PTPTSCTRL_TU_Pos)         /*!< 0x00000008 */
#define EMAC_PTPTSCTRL_TU                   EMAC_PTPTSCTRL_TU_Msk                   /*!< Timestamp Update */
#define EMAC_PTPTSCTRL_TI_Pos               (2U)
#define EMAC_PTPTSCTRL_TI_Msk               (0x1U << EMAC_PTPTSCTRL_TI_Pos)         /*!< 0x00000004 */
#define EMAC_PTPTSCTRL_TI                   EMAC_PTPTSCTRL_TI_Msk                   /*!< Timestamp Initialize */
#define EMAC_PTPTSCTRL_TFCU_Pos             (1U)
#define EMAC_PTPTSCTRL_TFCU_Msk             (0x1U << EMAC_PTPTSCTRL_TFCU_Pos)       /*!< 0x00000002 */
#define EMAC_PTPTSCTRL_TFCU                 EMAC_PTPTSCTRL_TFCU_Msk                 /*!< Timestamp Fine or Coarse Update */
#define EMAC_PTPTSCTRL_TE_Pos               (0U)
#define EMAC_PTPTSCTRL_TE_Msk               (0x1U << EMAC_PTPTSCTRL_TE_Pos)         /*!< 0x00000001 */
#define EMAC_PTPTSCTRL_TE                   EMAC_PTPTSCTRL_TE_Msk                   /*!< Timestamp Enable */

