HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
/*!< PR configuration */
#define EMAC_DMABM_PR_Pos                   (14U)
#define EMAC_DMABM_PR_Msk                   (0x3U << EMAC_DMABM_PR_Pos)             /*!< 0x0000C000 */
#define EMAC_DMABM_PR                       EMAC_DMABM_PR_Msk                       /*!< Priority Ratio */

#define EMAC_DMABM_PR_1_1                   0x00000000U                             /*!< Priority Ratio 1:1 */
#define EMAC_DMABM_PR_2_1                   0x00004000U                             /*!< Priority Ratio 2:1 */
#define EMAC_DMABM_PR_3_1                   0x00008000U                             /*!< Priority Ratio 3:1 */
#define EMAC_DMABM_PR_4_1                   0x0000C000U                             /*!< Priority Ratio 4:1 */

/*!< PBL configuration */
#define EMAC_DMABM_PBL_Pos                  (8U)
#define EMAC_DMABM_PBL_Msk                  (0x3FU << EMAC_DMABM_PBL_Pos)           /*!< 0x00003F00 */
#define EMAC_DMABM_PBL                      EMAC_DMABM_PBL_Msk                      /*!< Programmable Burst Length */

#define EMAC_DMABM_PBL_1Beat                0x00000100U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 1 */
#define EMAC_DMABM_PBL_2Beat                0x00000200U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 2 */
#define EMAC_DMABM_PBL_4Beat                0x00000400U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 4 */
#define EMAC_DMABM_PBL_8Beat                0x00000800U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 8 */
#define EMAC_DMABM_PBL_16Beat               0x00001000U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 16 */
#define EMAC_DMABM_PBL_32Beat               0x00002000U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 32 */
#define EMAC_DMABM_PBL_PBLx8_8Beat          0x01000100U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 8 */
#define EMAC_DMABM_PBL_PBLx8_16Beat         0x01000200U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 16 */
#define EMAC_DMABM_PBL_PBLx8_32Beat         0x01000400U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 32 */
#define EMAC_DMABM_PBL_PBLx8_64Beat         0x01000800U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 64 */
#define EMAC_DMABM_PBL_PBLx8_128Beat        0x01001000U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 128 */
#define EMAC_DMABM_PBL_PBLx8_256Beat        0x01002000U                             /*!< Max number of beats to be transfer in 1 Tx DMA operation is 256 */

#define EMAC_DMABM_DSL_Pos                  (2U)
#define EMAC_DMABM_DSL_Msk                  (0x1FU << EMAC_DMABM_DSL_Pos)           /*!< 0x0000007C */
#define EMAC_DMABM_DSL                      EMAC_DMABM_DSL_Msk                      /*!< Descriptor Skip Length */
#define EMAC_DMABM_DA_Pos                   (1U)
#define EMAC_DMABM_DA_Msk                   (0x1U << EMAC_DMABM_DA_Pos)             /*!< 0x00000002 */
#define EMAC_DMABM_DA                       EMAC_DMABM_DA_Msk                       /*!< DMA Arbitration */
#define EMAC_DMABM_SWR_Pos                  (0U)
#define EMAC_DMABM_SWR_Msk                  (0x1U << EMAC_DMABM_SWR_Pos)            /*!< 0x00000001 */
#define EMAC_DMABM_SWR                      EMAC_DMABM_SWR_Msk                      /*!< Software Reset */

/*****************  Bit definition for EMAC_DMATPD register  ******************/
#define EMAC_DMATPD_TPD_Pos                 (0U)
#define EMAC_DMATPD_TPD_Msk                 (0xFFFFFFFFU << EMAC_DMATPD_TPD_Pos)    /*!< 0xFFFFFFFF */
#define EMAC_DMATPD_TPD                     EMAC_DMATPD_TPD_Msk                     /*!< Transmit Poll Demand */

/*****************  Bit definition for EMAC_DMARPD register  ******************/
#define EMAC_DMARPD_RPD_Pos                 (0U)
#define EMAC_DMARPD_RPD_Msk                 (0xFFFFFFFFU << EMAC_DMARPD_RPD_Pos)    /*!< 0xFFFFFFFF */
#define EMAC_DMARPD_RPD                     EMAC_DMARPD_RPD_Msk                     /*!< Receive Poll Demand */

/***************  Bit definition for EMAC_DMARDLADDR register  ****************/
#define EMAC_DMARDLADDR_SRL_Pos             (0U)                                    /*!< 0xFFFFFFFF */
#define EMAC_DMARDLADDR_SRL_Msk             (0xFFFFFFFFU << EMAC_DMARDLADDR_SRL_Pos)
#define EMAC_DMARDLADDR_SRL                 EMAC_DMARDLADDR_SRL_Msk                 /*!< Start of Receive List */

/***************  Bit definition for EMAC_DMATDLADDR register  ****************/
#define EMAC_DMATDLADDR_STL_Pos             (0U)                                    /*!< 0xFFFFFFFF */
#define EMAC_DMATDLADDR_STL_Msk             (0xFFFFFFFFU << EMAC_DMATDLADDR_STL_Pos)
#define EMAC_DMATDLADDR_STL                 EMAC_DMATDLADDR_STL_Msk                 /*!< Start of Transmit List */

/*****************  Bit definition for EMAC_DMASTS register  ******************/
#define EMAC_DMASTS_TTI_Pos                 (29U)
#define EMAC_DMASTS_TTI_Msk                 (0x1U << EMAC_DMASTS_TTI_Pos)           /*!< 0x20000000 */
#define EMAC_DMASTS_TTI                     EMAC_DMASTS_TTI_Msk                     /*!< Timestamp Trigger Interrupt */
#define EMAC_DMASTS_MPI_Pos                 (28U)
#define EMAC_DMASTS_MPI_Msk                 (0x1U << EMAC_DMASTS_MPI_Pos)           /*!< 0x10000000 */
#define EMAC_DMASTS_MPI                     EMAC_DMASTS_MPI_Msk                     /*!< MAC PMT Interrupt */
#define EMAC_DMASTS_MMI_Pos                 (27U)
#define EMAC_DMASTS_MMI_Msk                 (0x1U << EMAC_DMASTS_MMI_Pos)           /*!< 0x08000000 */
#define EMAC_DMASTS_MMI                     EMAC_DMASTS_MMI_Msk                     /*!< MAC MMC Interrupt */

