HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
/*****************  Bit definition for EMAC_DMACRD register  ******************/
#define EMAC_DMACRD_HRDAP_Pos               (0U)
#define EMAC_DMACRD_HRDAP_Msk               (0xFFFFFFFFU << EMAC_DMACRD_HRDAP_Pos)  /*!< 0xFFFFFFFF */
#define EMAC_DMACRD_HRDAP                   EMAC_DMACRD_HRDAP_Msk                   /*!< Host Receive Descriptor Address Pointer */

/***************  Bit definition for EMAC_DMACTBADDR register  ****************/
#define EMAC_DMACTBADDR_HTBAP_Pos           (0U)                                    /*!< 0xFFFFFFFF */
#define EMAC_DMACTBADDR_HTBAP_Msk           (0xFFFFFFFFU << EMAC_DMACTBADDR_HTBAP_Pos)
#define EMAC_DMACTBADDR_HTBAP               EMAC_DMACTBADDR_HTBAP_Msk               /*!< Host Transmit Buffer Address Pointer */

/***************  Bit definition for EMAC_DMACRBADDR register  ****************/
#define EMAC_DMACRBADDR_HRBAP_Pos           (0U)                                    /*!< 0xFFFFFFFF */
#define EMAC_DMACRBADDR_HRBAP_Msk           (0xFFFFFFFFU << EMAC_DMACRBADDR_HRBAP_Pos)
#define EMAC_DMACRBADDR_HRBAP               EMAC_DMACRBADDR_HRBAP_Msk               /*!< Host Receive Buffer Address Pointer */

/******************************************************************************/
/*                                                                            */
/*                             Debug MCU (DEBUG)                              */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for DEBUG_IDCODE register  *****************/
#define DEBUG_IDCODE_PID_Pos                (0U)
#define DEBUG_IDCODE_PID_Msk                (0xFFFFFFFFU << DEBUG_IDCODE_PID_Pos)   /*!< 0xFFFFFFFF */
#define DEBUG_IDCODE_PID                    DEBUG_IDCODE_PID_Msk                    /*!< PID[31:0] bits (PID information) */
#define DEBUG_IDCODE_PID_0                  (0x00000001U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000001 */
#define DEBUG_IDCODE_PID_1                  (0x00000002U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000002 */
#define DEBUG_IDCODE_PID_2                  (0x00000004U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000004 */
#define DEBUG_IDCODE_PID_3                  (0x00000008U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000008 */
#define DEBUG_IDCODE_PID_4                  (0x00000010U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000010 */
#define DEBUG_IDCODE_PID_5                  (0x00000020U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000020 */
#define DEBUG_IDCODE_PID_6                  (0x00000040U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000040 */
#define DEBUG_IDCODE_PID_7                  (0x00000080U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000080 */
#define DEBUG_IDCODE_PID_8                  (0x00000100U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000100 */
#define DEBUG_IDCODE_PID_9                  (0x00000200U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000200 */
#define DEBUG_IDCODE_PID_10                 (0x00000400U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000400 */
#define DEBUG_IDCODE_PID_11                 (0x00000800U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00000800 */
#define DEBUG_IDCODE_PID_12                 (0x00001000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00001000 */
#define DEBUG_IDCODE_PID_13                 (0x00002000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00002000 */
#define DEBUG_IDCODE_PID_14                 (0x00004000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00004000 */
#define DEBUG_IDCODE_PID_15                 (0x00008000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00008000 */
#define DEBUG_IDCODE_PID_16                 (0x00010000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00010000 */
#define DEBUG_IDCODE_PID_17                 (0x00020000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00020000 */
#define DEBUG_IDCODE_PID_18                 (0x00040000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00040000 */
#define DEBUG_IDCODE_PID_19                 (0x00080000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00080000 */
#define DEBUG_IDCODE_PID_20                 (0x00100000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00100000 */
#define DEBUG_IDCODE_PID_21                 (0x00200000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00200000 */
#define DEBUG_IDCODE_PID_22                 (0x00400000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00400000 */
#define DEBUG_IDCODE_PID_23                 (0x00800000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x00800000 */
#define DEBUG_IDCODE_PID_24                 (0x01000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x01000000 */
#define DEBUG_IDCODE_PID_25                 (0x02000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x02000000 */
#define DEBUG_IDCODE_PID_26                 (0x04000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x04000000 */
#define DEBUG_IDCODE_PID_27                 (0x08000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x08000000 */
#define DEBUG_IDCODE_PID_28                 (0x10000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x10000000 */
#define DEBUG_IDCODE_PID_29                 (0x20000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x20000000 */
#define DEBUG_IDCODE_PID_30                 (0x40000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x40000000 */
#define DEBUG_IDCODE_PID_31                 (0x80000000U << DEBUG_IDCODE_PID_Pos)   /*!< 0x80000000 */

/******************  Bit definition for DEBUG_CTRL register  ******************/
#define DEBUG_CTRL_SLEEP_DEBUG_Pos          (0U)
#define DEBUG_CTRL_SLEEP_DEBUG_Msk          (0x1U << DEBUG_CTRL_SLEEP_DEBUG_Pos)    /*!< 0x00000001 */
#define DEBUG_CTRL_SLEEP_DEBUG              DEBUG_CTRL_SLEEP_DEBUG_Msk              /*!< Debug Sleep mode control bit */
#define DEBUG_CTRL_DEEPSLEEP_DEBUG_Pos      (1U)                                    /*!< 0x00000002 */
#define DEBUG_CTRL_DEEPSLEEP_DEBUG_Msk      (0x1U << DEBUG_CTRL_DEEPSLEEP_DEBUG_Pos)
#define DEBUG_CTRL_DEEPSLEEP_DEBUG          DEBUG_CTRL_DEEPSLEEP_DEBUG_Msk          /*!< Debug Deep sleep mode control bit */
#define DEBUG_CTRL_STANDBY_DEBUG_Pos        (2U)
#define DEBUG_CTRL_STANDBY_DEBUG_Msk        (0x1U << DEBUG_CTRL_STANDBY_DEBUG_Pos)  /*!< 0x00000004 */
#define DEBUG_CTRL_STANDBY_DEBUG            DEBUG_CTRL_STANDBY_DEBUG_Msk            /*!< Debug Standby mode control bit */
#define DEBUG_CTRL_TRACE_IOEN_Pos           (5U)
#define DEBUG_CTRL_TRACE_IOEN_Msk           (0x1U << DEBUG_CTRL_TRACE_IOEN_Pos)     /*!< 0x00000020 */
#define DEBUG_CTRL_TRACE_IOEN               DEBUG_CTRL_TRACE_IOEN_Msk               /*!< Trace pin assignment enable */

