HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xe.h
#define IS_TMR_CLOCKSOURCE_EXTMODE1_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_CLOCKSOURCE_EXTMODE2_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_CLOCKSOURCE_TRGIN_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8)    || \
   ((INSTANCE) == TMR9)    || \
   ((INSTANCE) == TMR12))

#define IS_TMR_CLOCKSOURCE_ISX_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8)    || \
   ((INSTANCE) == TMR9)    || \
   ((INSTANCE) == TMR12))

#define IS_TMR_OCXREF_CLEAR_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_ENCODER_INTERFACE_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_XOR_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_MASTER_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR6)    || \
   ((INSTANCE) == TMR7)    || \
   ((INSTANCE) == TMR8)    || \
   ((INSTANCE) == TMR12))

#define IS_TMR_SLAVE_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8)    || \
   ((INSTANCE) == TMR12))

#define IS_TMR_DMABURST_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_BREAK_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_CCX_INSTANCE(INSTANCE, CHANNEL) \
   ((((INSTANCE) == TMR1) &&                  \
     (((CHANNEL) == TMR_CHANNEL_1) ||          \
      ((CHANNEL) == TMR_CHANNEL_2) ||          \
      ((CHANNEL) == TMR_CHANNEL_3) ||          \
      ((CHANNEL) == TMR_CHANNEL_4)))           \
    ||                                         \
    (((INSTANCE) == TMR2) &&                   \
     (((CHANNEL) == TMR_CHANNEL_1) ||          \
      ((CHANNEL) == TMR_CHANNEL_2) ||          \
      ((CHANNEL) == TMR_CHANNEL_3) ||          \
      ((CHANNEL) == TMR_CHANNEL_4)))           \
    ||                                         \
    (((INSTANCE) == TMR3) &&                   \
     (((CHANNEL) == TMR_CHANNEL_1) ||          \
      ((CHANNEL) == TMR_CHANNEL_2) ||          \
      ((CHANNEL) == TMR_CHANNEL_3) ||          \
      ((CHANNEL) == TMR_CHANNEL_4)))           \
    ||                                         \
    (((INSTANCE) == TMR4) &&                   \
     (((CHANNEL) == TMR_CHANNEL_1) ||          \
      ((CHANNEL) == TMR_CHANNEL_2) ||          \
      ((CHANNEL) == TMR_CHANNEL_3) ||          \
      ((CHANNEL) == TMR_CHANNEL_4)))           \
    ||                                         \
    (((INSTANCE) == TMR5) &&                   \
     (((CHANNEL) == TMR_CHANNEL_1) ||          \
      ((CHANNEL) == TMR_CHANNEL_2) ||          \
      ((CHANNEL) == TMR_CHANNEL_3) ||          \
      ((CHANNEL) == TMR_CHANNEL_4)))           \
    ||                                         \
    (((INSTANCE) == TMR8) &&                   \
     (((CHANNEL) == TMR_CHANNEL_1) ||          \
      ((CHANNEL) == TMR_CHANNEL_2) ||          \
      ((CHANNEL) == TMR_CHANNEL_3) ||          \
      ((CHANNEL) == TMR_CHANNEL_4)))           \
    ||                                         \
    (((INSTANCE) == TMR9) &&                   \
     (((CHANNEL) == TMR_CHANNEL_1) ||          \
      ((CHANNEL) == TMR_CHANNEL_2)))           \
    ||                                         \
    (((INSTANCE) == TMR10) &&                  \
     (((CHANNEL) == TMR_CHANNEL_1)))           \
    ||                                         \
    (((INSTANCE) == TMR11) &&                  \
     (((CHANNEL) == TMR_CHANNEL_1)))           \
    ||                                         \
    (((INSTANCE) == TMR12) &&                  \
     (((CHANNEL) == TMR_CHANNEL_1) ||          \
      ((CHANNEL) == TMR_CHANNEL_2)))           \
    ||                                         \
    (((INSTANCE) == TMR13) &&                  \
     (((CHANNEL) == TMR_CHANNEL_1)))           \
    ||                                         \
    (((INSTANCE) == TMR14) &&                  \
     (((CHANNEL) == TMR_CHANNEL_1))))

#define IS_TMR_CCXN_INSTANCE(INSTANCE, CHANNEL) \
   ((((INSTANCE) == TMR1) &&                    \
     (((CHANNEL) == TMR_CHANNEL_1) ||           \
      ((CHANNEL) == TMR_CHANNEL_2) ||           \
      ((CHANNEL) == TMR_CHANNEL_3)))            \
    ||                                          \
    (((INSTANCE) == TMR8) &&                    \
     (((CHANNEL) == TMR_CHANNEL_1) ||           \
      ((CHANNEL) == TMR_CHANNEL_2) ||           \
      ((CHANNEL) == TMR_CHANNEL_3))))

#define IS_TMR_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

